/* OID.strings
/*
/* This file maps object identifiers (OIDs) to their corresponding labels.
/* These labels are used when displaying the details of a certificate's contents.
/*
/* NOTE TO LOCALIZERS:
/*
/* All strings in this file should eventually be localized. However, not all of them are
/* currently localizable. Specifically, there are a number of acronymns and abbreviations
/* which still need to be expanded into the corresponding English words. [3751398]
/*
/* Acronymns, such as "RSA," "DES," "X.509," "S/MIME," and so on, should be left alone for now.
/* Abbreviated labels such as "id-aa-dvcs-dvc" should also not be localized if present.


/* Deutsche Telekom */

"06 05 02 82 06 01 0A"			= "Telesec";
"06 06 02 82 06 01 0A 00"		= "Sambungan Telesec";
"06 06 02 82 06 01 0A 01"		= "Struktur jentera Telesec";

"06 07 02 82 06 01 0A 01 00"	= "Pengesahan Telesec";
"06 08 02 82 06 01 0A 01 00 01"	= "Pengesahan Kata Laluan";
"06 08 02 82 06 01 0A 01 00 02" = "Pengesahan Kata Laluan Dilindungi";
"06 08 02 82 06 01 0A 01 00 03" = "Pengesahan X.509 Sehala";
"06 08 02 82 06 01 0A 01 00 04" = "Pengesahan X.509 Dua Hala";
"06 08 02 82 06 01 0A 01 00 05" = "Pengesahan X.509 Tiga Hala";
"06 08 02 82 06 01 0A 01 00 06" = "pengesahan ISO9798 Sehala";
"06 08 02 82 06 01 0A 01 00 07" = "Pengesahan ISO9798 Dua Hala";
"06 08 02 82 06 01 0A 01 00 08" = "Pengesahan Telekom";

"06 07 02 82 06 01 0A 01 01"	= "Tandatangan Telesec";
"06 08 02 82 06 01 0A 01 01 01"	= "MD4 dengan RSA dan ISO9697";
"06 08 02 82 06 01 0A 01 01 02"	= "MD4 with RSA and Telesec Signature Standard

";
"06 08 02 82 06 01 0A 01 01 03"	= "MD5 dengan RSA dan ISO9697";
"06 08 02 82 06 01 0A 01 01 04"	= "MD5 with RSA and Telesec Signature Standard";
"06 08 02 82 06 01 0A 01 01 05"	= "RIPEMD-160 with RSA and Telekom Signature Standard";
"06 08 02 82 06 01 0A 01 01 09"	= "Tandatangan HBCI RSA";

"06 07 02 82 06 01 0A 01 02"	= "Telesec Encryption";
"06 08 02 82 06 01 0A 01 02 00"	= "tiada";
"06 08 02 82 06 01 0A 01 02 01"	= "RSA Telesec";
"06 08 02 82 06 01 0A 01 02 02"	= "DES";
"06 09 02 82 06 01 0A 01 02 02 01"	= "DES ECB";
"06 09 02 82 06 01 0A 01 02 02 02"	= "DES CBC";
"06 09 02 82 06 01 0A 01 02 02 03"	= "DES OFB";
"06 09 02 82 06 01 0A 01 02 02 04"	= "DES CFB8";
"06 09 02 82 06 01 0A 01 02 02 05"	= "DES CFB64";
"06 08 02 82 06 01 0A 01 02 03"	= "3DES";
"06 09 02 82 06 01 0A 01 02 03 01"	= "3DES ECB";
"06 09 02 82 06 01 0A 01 02 03 02"	= "3DES CBC";
"06 09 02 82 06 01 0A 01 02 03 03"	= "3DES OFB";
"06 09 02 82 06 01 0A 01 02 03 04"	= "3DES CFB8";
"06 09 02 82 06 01 0A 01 02 03 05"	= "3DES CFB64";
"06 08 02 82 06 01 0A 01 02 04"	= "Magenta";
"06 08 02 82 06 01 0A 01 02 05"	= "IDEA";
"06 09 02 82 06 01 0A 01 02 05 01"	= "IDEA ECB";
"06 09 02 82 06 01 0A 01 02 05 02"	= "IDEA CBC";
"06 09 02 82 06 01 0A 01 02 05 03"	= "IDEA OFB";
"06 09 02 82 06 01 0A 01 02 05 04"	= "IIDEA CFB8";
"06 09 02 82 06 01 0A 01 02 05 05"	= "IDEA CFB64";

"06 07 02 82 06 01 0A 01 03"	= "Fungsi Sehala";
"06 08 02 82 06 01 0A 01 03 01"	= "MD4";
"06 08 02 82 06 01 0A 01 03 02"	= "MD5";
"06 08 02 82 06 01 0A 01 03 03"	= "SqModN-X509";
"06 08 02 82 06 01 0A 01 03 04"	= "SqModN-ISO";
"06 08 02 82 06 01 0A 01 03 05"	= "RIPEMD-128";
"06 08 02 82 06 01 0A 01 03 06"	= "Hash menggunakan Block Cipher";
"06 08 02 82 06 01 0A 01 03 07"	= "MAC";
"06 08 02 82 06 01 0A 01 03 08"	= "RIPEMD-160";

"06 07 02 82 06 01 0A 01 04"	= "Fungsi FEC";
"06 08 02 82 06 01 0A 01 04 01"	= "Reed Solomon";

"06 06 02 82 06 01 0A 02"		= "Module Telesec";
"06 07 02 82 06 01 0A 02 00"	= "Algoritma";
"06 07 02 82 06 01 0A 02 01"	= "Jenis Sifat";
"06 07 02 82 06 01 0A 02 02"	= "Jenis-jenis Sijil";
"06 07 02 82 06 01 0A 02 03"	= "Jenis Mesej";
"06 07 02 82 06 01 0A 02 04"	= "Protocol PL";
"06 07 02 82 06 01 0A 02 05"	= "SME dan Component dari SME";
"06 07 02 82 06 01 0A 02 06"	= "FEC";
"06 07 02 82 06 01 0A 02 07"	= "Definisi Berguna";
"06 07 02 82 06 01 0A 02 08"	= "Fail STE";
"06 07 02 82 06 01 0A 02 09"	= "SAdmin";
"06 07 02 82 06 01 0A 02 0A"	= "Pesanan Elektronik";
"06 07 02 82 06 01 0A 02 0B"	= "Aplikasi Asymmetric Telesec TTP ";
"06 07 02 82 06 01 0A 02 0C"	= "Aplikasi Asas Telesec TTP ";
"06 07 02 82 06 01 0A 02 0D"	= "Mesej Telesec TTP";
"06 07 02 82 06 01 0A 02 0E"	= "Aplikasi Stem Masa Telesec TTP ";

"06 06 02 82 06 01 0A 03"		= "Kelas Objek";
"06 07 02 82 06 01 0A 03 00"	= "Nama Lain Telesec";
"06 07 02 82 06 01 0A 03 01"	= "Direktori";
"06 07 02 82 06 01 0A 03 02"	= "Jenis Direktori";
"06 07 02 82 06 01 0A 03 03"	= "Kumpulan Direktori";
"06 07 02 82 06 01 0A 03 04"	= "Pengguna Direktori";
"06 07 02 82 06 01 0A 03 05"	= "Kemasukan Kunci Symmetric";

"06 06 02 82 06 01 0A 04"		= "Pakej";
"06 06 02 82 06 01 0A 05"		= "Parameter";
"06 06 02 82 06 01 0A 06"		= "Ikatan Nama";
"06 06 02 82 06 01 0A 07"		= "Sifat";
"06 07 02 82 06 01 0A 07 00"	= "Pengecam Kumpulan Aplikasi";
"06 07 02 82 06 01 0A 07 01"	= "Jenis Sijil";
"06 07 02 82 06 01 0A 07 02"	= "Sijil Telesec";
"06 07 02 82 06 01 0A 07 03"	= "Nombor Sijil";
"06 07 02 82 06 01 0A 07 04"	= "Senarai Pembatalan Sijil";
"06 07 02 82 06 01 0A 07 05"	= "Tarikh Dicipta";
"06 07 02 82 06 01 0A 07 06"	= "Pengeluar";
"06 07 02 82 06 01 0A 07 07"	= "Kuasa Pernamaan";
"06 07 02 82 06 01 0A 07 08"	= "Direktori Kunci Awam";
"06 07 02 82 06 01 0A 07 09"	= "Keselamatan Domain";
"06 07 02 82 06 01 0A 07 0A"	= "Subjek";
"06 07 02 82 06 01 0A 07 0B"	= "Masa Pembatalan";
"06 07 02 82 06 01 0A 07 0C"	= "Rujukan Kumpulan Pengguna";
"06 07 02 82 06 01 0A 07 0D"	= "Pengesahan";
"06 07 02 82 06 01 0A 07 0E"	= "ZERT93";
"06 07 02 82 06 01 0A 07 0F"	= "Persekitaran Keselamatan Mesej";
"06 07 02 82 06 01 0A 07 10"	= "Daftar Nama Kunci Anonymized Awam";
"06 07 02 82 06 01 0A 07 11"	= "Nama Yang diberi oleh Telesec";
"06 07 02 82 06 01 0A 07 12"	= "Nama Tambahan";
"06 07 02 82 06 01 0A 07 13"	= "Poskod Telesec";
"06 07 02 82 06 01 0A 07 14"	= "Pengecam Nama";
"06 07 02 82 06 01 0A 07 15"	= "Senarai Sijil Telesec";
"06 07 02 82 06 01 0A 07 16"	= "Senarai Sijil Teletrust";
"06 07 02 82 06 01 0A 07 17"	= "X.509 Senarai Sijil";
"06 07 02 82 06 01 0A 07 18"	= "Masa Dikeluarkan";
"06 07 02 82 06 01 0A 07 19"	= "Nombor Kad Fizikal";
"06 07 02 82 06 01 0A 07 1A"	= "Jenis Fail";
"06 07 02 82 06 01 0A 07 1B"	= "Fail Ctl adalah Archive";
"06 07 02 82 06 01 0A 07 1C"	= "Alamat E-mel";
"06 07 02 82 06 01 0A 07 1D"	= "Senarai Template Sijil";
"06 07 02 82 06 01 0A 07 1E"	= "Nama Direktori";
"06 07 02 82 06 01 0A 07 1F"	= "Direktori Jenis Nama";
"06 07 02 82 06 01 0A 07 20"	= "Nama Kumpulan Direktori";
"06 07 02 82 06 01 0A 07 21"	= "Nama Pengguna Untuk Direktori";
"06 07 02 82 06 01 0A 07 22"	= "Tanda Pembatalan";
"06 07 02 82 06 01 0A 07 23"	= "Nama Kemasukan Kunci Symmetric";
"06 07 02 82 06 01 0A 07 24"	= "Nombor GL";
"06 07 02 82 06 01 0A 07 25"	= "Nombor GO";
"06 07 02 82 06 01 0A 07 26"	= "Kunci Maklumat G";
"06 07 02 82 06 01 0A 07 27"	= "Kunci Maklumat Z";
"06 07 02 82 06 01 0A 07 28"	= "Kunci Maklumat KT";
"06 07 02 82 06 01 0A 07 2A"	= "Nombor Kunci KT";
"06 07 02 82 06 01 0A 07 33"	= "Masa Penjanaan Pembatalan";
"06 07 02 82 06 01 0A 07 34"	= "Teks Liabiliti";

"06 06 02 82 06 01 0A 08"		= "Kumpulan Atribut";
"06 06 02 82 06 01 0A 09"		= "Tindakan";
"06 06 02 82 06 01 0A 0A"		= "Pemberitahuan";
"06 06 02 82 06 01 0A 0B"		= "SNMP-MIBS";

"06 07 02 82 06 01 0A 0B 01"	= "Aplikasi Keselamatan";

"06 06 02 82 06 01 0A 0C"		= "Definasi Sambungan Sijil dan CRL";

"06 07 02 82 06 01 0A 0C 00"	= "Liabiliti Sijil Tambahan Batasan Tambahan ";
"06 07 02 82 06 01 0A 0C 01"	= "Sijil ID Sambungan Telesec";
"06 07 02 82 06 01 0A 0C 02"	= "Pengecam Polisi Telesec";
"06 07 02 82 06 01 0A 0C 03"	= "ID Pengesah Polisi Telesec";
"06 07 02 82 06 01 0A 0C 04"	= "Sambungan Telesec CRL yang telah ditapis";
"06 07 02 82 06 01 0A 0C 05"	= "Sambungan penapis Telesec CRL";
"06 07 02 82 06 01 0A 0C 06"	= "Sambungan Jawatan Kuasa Pernamaan Telesec";

/* RFC 1274 (X.500 attribute collection from the UK, thus the weird OID). */

"06 0A 09 92 26 89 93 F2 2C 64 01 01"	= "ID Pengguna";
"06 0A 09 92 26 89 93 F2 2C 64 01 03"	= "RFC822 Peti Mel";

/* RFC 2247 */

"06 0A 09 92 26 89 93 F2 2C 64 01 19"	= "Component Domain";

/* Australian Government */

"06 06 2A 24 01 82 4D 01"   = "Nombor Bisnes Australia";

/* Certificates Australia */

"06 0A 2A 24 A4 97 A3 53 01 64 01 01"	= "Pengecam Polisi Sijil Australia";

/* Signet */

"06 09 2A 24 A0 F2 A0 7D 01 01 02"	= "Signet Peribadi";
"06 09 2A 24 A0 F2 A0 7D 01 01 03"	= "Bisnes Signet";
"06 09 2A 24 A0 F2 A0 7D 01 01 04"	= "Signet Sah";
"06 09 2A 24 A0 F2 A0 7D 01 01 0A"	= "Signet Pilot";
"06 09 2A 24 A0 F2 A0 7D 01 01 0B"	= "Signet IntraNet";
"06 09 2A 24 A0 F2 A0 7D 01 01 14"	= "Pengecam Polisi Signet";

/* Mitsubishi */

"06 0B 2A 83 08 8C 1A 4B 3D 01 01 01"		= "Algoritma Penyulitan Bersimetri";
"06 0C 2A 83 08 8C 9A 4B 3D 01 01 01 01"	= "MISTY1-CBC";

/* SEIS */

"06 05 2A 85 70 22 01"		= "SEIS CP";
"06 06 2A 85 70 22 01 01"	= "Pengesah Polisi Tinggi-Keyakinan SEIS";
"06 06 2A 85 70 22 01 02"	= "Pengecam Polisi SEIS GAK";
"06 05 2A 85 70 22 02"		= "SEIS PE";
"06 05 2A 85 70 22 03"		= "SEIS AT";
"06 06 2A 85 70 22 03 01"	= "Pengecam Peribadi SEIS AT";

/* ANSI X9.57 */

"06 06 2A 86 48 CE 38 01"		= "ANSI X9.57 Module";
"06 07 2A 86 48 CE 38 01 01"	= "Pentadbir Sijil X9F1";
"06 06 2A 86 48 CE 38 02"		= "Pegang Arahan";
"06 07 2A 86 48 CE 38 02 01"	= "Pegang Arahan-Tiada";
"06 07 2A 86 48 CE 38 02 02"	= "Pengeluar Panggilan";
"06 07 2A 86 48 CE 38 02 03"	= "Menolak";
"06 07 2A 86 48 CE 38 02 04"	= "Mengambil Tanda";
"06 06 2A 86 48 CE 38 03"		= "Sifat";
"06 06 2A 86 48 CE 38 03 01"	= "Countersignature";
"06 06 2A 86 48 CE 38 03 02"	= "Sijil Sifat";
"06 06 2A 86 48 CE 38 04"		= "Algoritma";
"06 07 2A 86 48 CE 38 04 01"	= "DSA";
"06 07 2A 86 48 CE 38 04 02"	= "DSA Match";
"06 07 2A 86 48 CE 38 04 03"	= "DSA dengan SHA-1";

/* ANSI X9.62 */

"06 06 2A 86 48 CE 3D 01"		= "Bidang Jenis ANSI X9.62";
"06 07 2A 86 48 CE 3D 01 01"	= "Medan Utama";
"06 07 2A 86 48 CE 3D 01 02"	= "Characteristic-Two Field";
"06 09 2A 86 48 CE 3D 01 02 03"	= "Characteristic-Two Basis";
"06 0A 2A 86 48 CE 3D 01 02 03 01"	= "Null Basis";
"06 0A 2A 86 48 CE 3D 01 02 03 02"	= "Trinomial Asas";
"06 0A 2A 86 48 CE 3D 01 02 03 03"	= "Pentanomial Basis";
"06 06 2A 86 48 CE 3D 02"		= "Jenis Kunci Awam";
"06 07 2A 86 48 CE 3D 02 01"	= "Kunci Awam Elliptic Curve";

/* ANSI X9.42 */

"06 06 2A 86 48 CE 3E 01"		= "Bidang Jenis ANSI X9.42";
"06 07 2A 86 48 CE 3E 01 01"	= "Bidang Perdana Galois";
"06 06 2A 86 48 CE 3E 02"		= "Jenis Kata Kunci";
"06 07 2A 86 48 CE 3E 02 01"	= "Kunci Awam Diffie-Hellman";
"06 06 2A 86 48 CE 3E 03"		= "Skim";
"06 07 2A 86 48 CE 3E 03 01"	= "Static Diffie-Hellman";
"06 07 2A 86 48 CE 3E 03 02"	= "Diffie-Hellman Ephemeral";
"06 07 2A 86 48 CE 3E 03 03"	= "Diffie-Hellman Hybrid 1";
"06 07 2A 86 48 CE 3E 03 04"	= "Diffie-Hellman Hybrid 2";
"06 07 2A 86 48 CE 3E 03 05"	= "MQV2";
"06 07 2A 86 48 CE 3E 03 06"	= "MQV1";

/* Nortel Secure Networks/Entrust */

"06 07 2A 86 48 86 F6 7D 07"		= "NSN";
"06 08 2A 86 48 86 F6 7D 07 41"		= "NSN-CE";
"06 09 2A 86 48 86 F6 7D 07 41 00"	= "Percaya Maklumat Versi";
"06 08 2A 86 48 86 F6 7D 07 42"		= "NSN-Alg";
"06 09 2A 86 48 86 F6 7D 07 42 03"	= "CAST3-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0A"	= "CAST5-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0B"	= "CAST5-MAC";
"06 09 2A 86 48 86 F6 7D 07 42 0C"	= "PBE dengan MD5 dan CAST5-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0D"	= "MAC Berasaskan Kata Laluan";
"06 08 2A 86 48 86 F6 7D 07 43"		= "NSN-OC";
"06 09 2A 86 48 86 F6 7D 07 43 0C"	= "Percaya Pengguna";
"06 08 2A 86 48 86 F6 7D 07 44"		= "NSN-AT";
"06 09 2A 86 48 86 F6 7D 07 44 00"	= "Percaya Maklumat CA";
"06 09 2A 86 48 86 F6 7D 07 44 0A"	= "Sijil Sifat";

/* PKCS #1 */

"06 08 2A 86 48 86 F7 0D 01 01"		= "PKCS-1";
"06 09 2A 86 48 86 F7 0D 01 01 01"	= "RSA Encryption";
"06 09 2A 86 48 86 F7 0D 01 01 02"	= "MD2 dengan Encryption RSA";
"06 09 2A 86 48 86 F7 0D 01 01 03"	= "MD4 dengan Encryption RSA";
"06 09 2A 86 48 86 F7 0D 01 01 04"	= "MD5 dengan Encryption RSA";
"06 09 2A 86 48 86 F7 0D 01 01 05"	= "SHA-1 dengan Encryption RSA";
"06 09 2A 86 48 86 F7 0D 01 01 06"	= "RSA-OAEP Encryption (SET)";
"06 09 2A 86 48 86 F7 0D 01 01 07"	= "RSA-OAEP Encryption";
"06 09 2A 86 48 86 F7 0D 01 01 08"	= "RSA-OAEP-MGF";
"06 09 2A 86 48 86 F7 0D 01 01 09"	= "Label Ditentukan RSA-OAEP";
"06 09 2A 86 48 86 F7 0D 01 01 0A"	= "Scheme Tandatangan RSA-PSS";
"06 09 2A 86 48 86 F7 0D 01 01 0B"	= "SHA-256 dengan Encryption RSA";
"06 09 2A 86 48 86 F7 0D 01 01 0C"	= "SHA-384 dengan Encryption RSA";
"06 09 2A 86 48 86 F7 0D 01 01 0D"	= "SHA-512 dengan Encryption RSA";
"06 09 2A 86 48 86 F7 0D 01 01 0E"	= "SHA-224 dengan Encryption RSA";

/* BSAFE/PKCS #2 (obsolete) */

"06 08 2A 86 48 86 F7 0D 01 02"		= "Encryption BSAFE";

/* PKCS #3 */

"06 08 2A 86 48 86 F7 0D 01 03"		= "PKCS-3";
"06 09 2A 86 48 86 F7 0D 01 03 01"	= "Kunci Persetujuaan Diffie-Hellman";

/* PKCS #5 */

"06 08 2A 86 48 86 F7 0D 01 05"		= "PKCS-5";
"06 09 2A 86 48 86 F7 0D 01 05 01"	= "PBE dengan MD2 and DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 03"	= "PBE dengan MD5 and DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 04"	= "PBE dengan MD2 and RC2-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 06"	= "PBE dengan MD5 and RC2-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 09"	= "PBE dengan MD5 dan XOR";
"06 09 2A 86 48 86 F7 0D 01 05 0A"	= "PBE dengan SHA dan DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 0C"	= "PKCS-5 PBKDF2";
"06 09 2A 86 48 86 F7 0D 01 05 0D"	= "PKCS-5 PBES2";
"06 09 2A 86 48 86 F7 0D 01 05 0E"	= "PKCS-5 PBMAC1";

/* PKCS #7 */

"06 08 2A 86 48 86 F7 0D 01 07"		= "PKCS-7";
"06 09 2A 86 48 86 F7 0D 01 07 01"	= "Maklumat
";
"06 09 2A 86 48 86 F7 0D 01 07 02"	= "Data Bertandatangan";
"06 09 2A 86 48 86 F7 0D 01 07 03"	= "Maklumat Bersampul";
"06 09 2A 86 48 86 F7 0D 01 07 04"	= "Data Bertandatangan dan Disampul";
"06 09 2A 86 48 86 F7 0D 01 07 05"	= "Maklumat Digested";
"06 09 2A 86 48 86 F7 0D 01 07 06"	= "Data Disulitkan";
"06 09 2A 86 48 86 F7 0D 01 07 07"	= "Maklumat yang Bersifat";
"06 09 2A 86 48 86 F7 0D 01 07 08"	= "Maklumat Kunci Peribadi Disulitkan";

/* PKCS #9 */

"06 08 2A 86 48 86 F7 0D 01 09"		= "PKCS-9";
"06 09 2A 86 48 86 F7 0D 01 09 01"	= "Alamat E-mel";
"06 09 2A 86 48 86 F7 0D 01 09 02"	= "Nama Tidak Berstruktur";
"06 09 2A 86 48 86 F7 0D 01 09 03"	= "Jenis Kandungan";
"06 09 2A 86 48 86 F7 0D 01 09 04"	= "Digest Mesej";
"06 09 2A 86 48 86 F7 0D 01 09 05"	= "Masa Tandatangan";
"06 09 2A 86 48 86 F7 0D 01 09 06"	= "Countersignature";
"06 09 2A 86 48 86 F7 0D 01 09 07"	= "Cabaran Kata Laluan";
"06 09 2A 86 48 86 F7 0D 01 09 08"	= "Alamat Tidak Berstruktur";
"06 09 2A 86 48 86 F7 0D 01 09 09"	= "Sifat Sijil Tambahan";
"06 09 2A 86 48 86 F7 0D 01 09 0A"	= "Pengeluar dan Nombor Serial";
"06 09 2A 86 48 86 F7 0D 01 09 0B"	= "Semakan Kata Laluan";
"06 09 2A 86 48 86 F7 0D 01 09 0C"	= "Kunci Awam";
"06 09 2A 86 48 86 F7 0D 01 09 0D"	= "Diskripsi Signing";
"06 09 2A 86 48 86 F7 0D 01 09 0E"	= "Permintaan Sambungan";

/* PKCS #9 for use with S/MIME */

"06 09 2A 86 48 86 F7 0D 01 09 0F"		= "Kemampuan S/MIME";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 01"	= "Utamakan Data Bertandatangan";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 02"	= "Tidak Boleh Nyahenkripsi";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 03"	= "Permintaan Resit";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 04"	= "Resit";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 05"	= "Petunjuk Kandungan";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 06"	= "Sejarah Senarai Mel Tambahan";

"06 09 2A 86 48 86 F7 0D 01 09 10"			= "S/MIME";

/* S/MIME Modules */

"06 0A 2A 86 48 86 F7 0D 01 09 10 00"		= "S/MIME Modules";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 01"	= "Sintaks Mesej Kriptografi";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 02"	= "Khidmat Keselamatan Ditingkatkan";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 03"	= "Pengecam Objek S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 04"	= "S/MIME V3 Mesej";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 05"	= "ETS Electronic Signature 88

";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 06"	= "ETS Electronic Signature 97

";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 07"	= "ETS Electronic Signature Policy 88

";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 08"	= "ETS Electronic Signature Policy 97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 09"	= "id-mod-certdist";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0A"	= "id-mod-domsec";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0B"	= "id-mod-compress";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0C"	= "id-mod-symkeydist";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0D"	= "id-mod-cek-reuse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0E"	= "id-mod-cms-2001";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0F"	= "id-mod-v1AttrCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 10"	= "id-mod-cmsalg-2001";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 11"	= "id-mod-cms-pwri-88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 12"	= "id-mod-cms-pwri-97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 13"	= "iid-mod-cms-aes";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 14"	= "id-mod-cms-rsaes-oaep";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 15"	= "id-mod-msg-v3dot1";

/* S/MIME Content Types */

"06 0A 2A 86 48 86 F7 0D 01 09 10 01"		= "Jenis Kandungan S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 01"	= "id-ct-resit";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 02"	= "id-ct-authData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 03"	= "id-ct-publishCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 04"	= "id-ct-TSTInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 05"	= "id-ct-TDTInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 06"	= "id-ct-contentInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 07"	= "id-ct-DVCSRequestData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 08"	= "id-ct-DVCSResponseData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 09"	= "id-ct-compressedData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0A"	= "id-ct-svcp-certValRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0B"	= "id-ct-svcp-certValResponse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0C"	= "iid-ct-svcp-valPolRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0D"	= "id-ct-svcp-valPolResponse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0E"	= "id-ct-attrCertEncAttrs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0F"	= "id-ct-TSReq";

/* S/MIME Authenticated Attributes */

"06 0A 2A 86 48 86 F7 0D 01 09 10 02"		= "Sifat Pengesahan S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 01"	= "id-aa-receiptRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 02"	= "id-aa-securityLabel";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 03"	= "id-aa-mlExpandHistory";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 04"	= "id-aa-contentHint";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 05"	= "id-aa-msgSigDigest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 06"	= "id-aa-encapContentType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 07"	= "id-aa-contentHint";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 08"	= "id-aa-macValue";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 09"	= "id-aa-equivalentLabels";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0A"	= "id-aa-contentReferenc";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0B"	= "id-aa-encrypKeyPref";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0C"	= "id-aa-signingCertificate";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0D"	= "id-aa-smimeEncryptCerts";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0E"	= "id-aa-timeStampToken";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0F"	= "id-aa-ets-sigPolicyId";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 10"	= "id-aa-ets-commitmentType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 11"	= "id-aa-ets-signerLocation";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 12"	= "id-aa-ets-signerAttr";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 13"	= "id-aa-ets-otherSigCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 14"	= "id-aa-ets-contentTimestamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 15"	= "id-aa-ets-CertificateRefs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 16"	= "id-aa-ets-RevocationRefs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 17"	= "id-aa-ets-certValues";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 18"	= "id-aa-ets-revocationValues";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 19"	= "id-aa-ets-escTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1A"	= "id-aa-ets-certCRLTimestamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1B"	= "id-aa-ets-archiveTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1C"	= "id-aa-signatureType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1D"	= "id-aa-dvcs-dvc";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1E"	= "id-aa-CEKReference";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1F"	= "id-aa-maxCEKDecrypts";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 20"	= "id-aa-KEKDerivationAlg";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 21"	= "id-aa-intendedRecipients";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 22"	= "id-aa-cmc-unsignedData";

/* S/MIME Algorithms */

"06 0A 2A 86 48 86 F7 0D 01 09 10 03"		= "Algoritma S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 01"	= "id-alg-ESDHdengan3DES";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 02"	= "id-alg-ESDHdenganRC2";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 03"	= "id-alg-3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 04"	= "id-alg-RC2wrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 05"	= "id-alg-ESDH";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 06"	= "iid-alg-CMS3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 07"	= "id-alg-CMSRC2wrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 08"	= "id-alg-zlib";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 09"	= "id-alg-PWRI-KEK";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0A"	= "id-alg-SSDH";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0B"	= "id-alg-HMACdengan3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0C"	= "id-alg-HMACdenganAESwrap";

/* S/MIME Certificate Distribution */

"06 0A 2A 86 48 86 F7 0D 01 09 10 04"		= "Pengedar Sijil S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 04 01"	= "Pengedar Sijil LDAP";

/* S/MIME Signature Policy Qualifier */

"06 0A 2A 86 48 86 F7 0D 01 09 10 05"		= "Kelayakan Polisi Tandatangan S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 05 01"	= "id-spq-ets-sqt-uri";
"06 0B 2A 86 48 86 F7 0D 01 09 10 05 02"	= "id-spq-ets-sqt-unotice";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 01"	= "id-cti-ets-proofOfOrigin";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 02"	= "id-cti-ets-proofOfReceipt";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 03"	= "id-cti-ets-proofOfDelivery";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 04"	= "id-cti-ets-proofOfSender";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 05"	= "id-cti-ets-proofOfApproval";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 06"	= "id-cti-ets-proofOfCreation";

/* S/MIME Signature Type Identifier */

"06 0A 2A 86 48 86 F7 0D 01 09 10 09"		= "Pengecam Jenis Tandatangan S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 01"	= "Tandatangan Pemilik Asal";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 02"	= "Tandatangan Domain";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 03"	= "Sifat Tandatangan Tambahan";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 04"	= "Rujukan Tandatangan";

/* S/MIME Capabilities */

"06 0A 2A 86 48 86 F7 0D 01 09 10 0B"		= "Kemampuan S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 0B 01"	= "Kecenderungan Binary Dalam";

/* PKCS #9 for use with PKCS #12 */

"06 09 2A 86 48 86 F7 0D 01 09 14"			= "Nama Samaran (untuk PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 15"			= "Kunci ID Tempatan (untuk PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 16"			= "Jenis Sijil (Untuk PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 16 01"		= "X.509 Sijil (untuk PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 16 02"		= "Sijil SDSI (untuk PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 17"			= "Jenis CRL (Untuk PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 17 01"		= "X.509 CRL (untuk PKCS-12)";

/* PKCS #12 */

"06 08 2A 86 48 86 F7 0D 01 0C"				= "PKCS-12 Sintaks Pertukaran Maklumat Peribadi";
"06 09 2A 86 48 86 F7 0D 01 0C 01"			= "PKCS-12 ID Enkripsi Berdasarkan Kata Laluan";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 01"		= "PBE dengan SHA-1 dan 128-Bit RC4";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 02"		= "PBE dengan SHA-1 dan 40-Bit RC4";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 03"		= "PBE dengan SHA-1 dan 3- Kunci tiga kali ganda DES-CBC";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 04"		= "PBE dengan SHA-1 dan 2- Kunci tiga kali ganda DES-CBC";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 05"		= "PBE dengan SHA-1 dan 128-Bit RC2-CBC";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 06"		= "PBE dengan SHA-1 dan 40-Bit RC2-CBC";
"06 09 2A 86 48 86 F7 0D 01 0C 02"			= "PKCS-12 ESPVK IDs";
"06 0A 2A 86 48 86 F7 0D 01 0C 02 01"		= "PKCS-12 PKCS-8 Key Shrouding";
"06 09 2A 86 48 86 F7 0D 01 0C 03"			= "PKCS-12 Bag IDs";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 01"		= "PKCS-12 Key Bag ID";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 02"		= "PKCS-12 Sijil dan CRL Bag ID";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 03"		= "PKCS-12 Bag ID Rahsia";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 04"		= "PKCS-12 Kandungan ID Selamat";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 05"		= "PKCS-12 PKCS-8 Shrouded Key Bag ID";
"06 09 2A 86 48 86 F7 0D 01 0C 04"			= "PKCS-12 Sijil Bag ID";
"06 0A 2A 86 48 86 F7 0D 01 0C 04 01"		= "PKCS-12 X.509 Sijil dan CRL Bag ID";
"06 0A 2A 86 48 86 F7 0D 01 0C 04 02"		= "PKCS-12 SDSI Sijil Bag ID";

"06 09 2A 86 48 86 F7 0D 01 0C 05"			= "PKCS-12 OID";
"06 0A 2A 86 48 86 F7 0D 01 0C 05 01"		= "PKCS-12 ID Enkripsi Berdasarkan Kata Laluan";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 01"	= "PKCS-12 PBE dengan SHA-1 dan 128-Bit RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 02"	= "PKCS-12 PBE dengan SHA-1 dan 40-Bit RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 03"	= "PKCS-12 PBE dengan SHA-1 dan Tiga kali ganda DES-CBC";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 04"	= "PKCS-12 PBE dengan SHA-1 dan 128-Bit RC2-CBC";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 05"	= "PKCS-12 PBE dengan SHA-1 dan 40-Bit RC2-CBC";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 06"	= "PKCS-12 PBE dengan SHA-1 dan RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 07"	= "PKCS-12 PBE dengan SHA-1 dan RC2-CBC";

"06 0A 2A 86 48 86 F7 0D 01 0C 05 02"		= "PKCS-12 Enveloping IDs";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 01"	= "PKCS-12 RSA dengan Encryption 128-Bit RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 02"	= "PKCS-12 RSA dengan Encryption 40-Bit RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 03"	= "PKCS-12 RSA dengan Encryption Tiga kali ganda DES";

"06 0A 2A 86 48 86 F7 0D 01 0C 05 03"		= "Tandatangan ID PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 03 01"	= "PKCS-12 RSA dengan Tandatangan SHA-1 Digest";

"06 09 2A 86 48 86 F7 0D 01 0C 0A"			= "PKCS-12 Versi 1";
"06 0A 2A 86 48 86 F7 0D 01 0C 0A 01"		= "PKCS-12 Bag IDs";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 01"	= "PKCS-12 Key Bag";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 02"	= "PKCS-12 PKCS-8 Shrouded Key Bag";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 03"	= "PKCS-12 Sijil Bag";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 04"	= "PKCS-12 CRL Bag";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 05"	= "PKCS-12 Bag Rahsia";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 06"	= "PKCS-12 Kandungan Bag Selamat";

/* PKCS #15 */

"06 09 2A 86 48 86 F7 0D 01 0F 01"		= "Module PKCS-15";
"06 09 2A 86 48 86 F7 0D 01 0F 02"		= "Sifat PKCS-15";
"06 09 2A 86 48 86 F7 0D 01 0F 03"		= "Jenis Kandungan PKCS-15";
"06 0A 2A 86 48 86 F7 0D 01 0F 03 01"	= "Kandungan PKCS-15";

/* RSADSI digest algorithms */

"06 08 2A 86 48 86 F7 0D 02"			= "Algoritma Rumusan RSADSI";
"06 08 2A 86 48 86 F7 0D 02 02"			= "MD2";
"06 08 2A 86 48 86 F7 0D 02 04"			= "MD4";
"06 08 2A 86 48 86 F7 0D 02 05"			= "MD5";
"06 08 2A 86 48 86 F7 0D 02 07"			= "HMAC dengan SHA-1";

/* RSADSI encryption algorithms */

"06 08 2A 86 48 86 F7 0D 03"			= "Algoritma Penyulitan RSADSI";
"06 08 2A 86 48 86 F7 0D 03 02"			= "RC2-CBC";
"06 08 2A 86 48 86 F7 0D 03 03"			= "RC2-ECB";
"06 08 2A 86 48 86 F7 0D 03 04"			= "RC4";
"06 08 2A 86 48 86 F7 0D 03 05"			= "RC4 with MAC";
"06 08 2A 86 48 86 F7 0D 03 06"			= "DESX-CBC";
"06 08 2A 86 48 86 F7 0D 03 07"			= "DES-EDE3-CBC";
"06 08 2A 86 48 86 F7 0D 03 08"			= "RC5-CBC";
"06 08 2A 86 48 86 F7 0D 03 09"			= "RC5-CBC Pad";
"06 08 2A 86 48 86 F7 0D 03 0A"			= "DES-CDMF";

/* Identrus */

"06 09 2A 86 48 86 FA 65 01 06 01"		= "Identrus Pengecam polisi Yang tidak Dikenali";
"06 08 2A 86 48 86 FA 65 04 01"			= "Identrus OCSP";

/* Ascom Systech */

"06 0A 2B 06 01 04 01 81 3C 07 01 01"		= "Ascom";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 01"	= "IDEA-ECB";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 02"	= "IDEA-CBC";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 03"	= "IDEA-CFB";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 04"	= "IDEA-OFB";

/* MIT */

"06 09 2A 86 48 86 F7 12 01 02 02"			= "MIT Kerberos V5";
"06 0A 2A 86 48 86 F7 12 01 02 02 03"		= "MIT Pengguna-ke-Pengguna Kerberos";

/* Microsoft */

"06 09 2A 86 48 82 F7 12 01 02 02"			= "Microsoft Kerberos";

"06 08 2A 86 48 86 F7 14 01 03"				= "Kelas objek Microsoft Exchange Server";
"06 09 2A 86 48 86 F7 14 01 03 00"			= "Site-Addressing";
"06 09 2A 86 48 86 F7 14 01 03 0D"			= "Skema Kelas";
"06 09 2A 86 48 86 F7 14 01 03 0E"			= "Sifat Schema";
"06 09 2A 86 48 86 F7 14 01 03 11"			= "Mailbox-Agent";
"06 09 2A 86 48 86 F7 14 01 03 16"			= "Peti Mel";
"06 09 2A 86 48 86 F7 14 01 03 17"			= "Bekas";
"06 09 2A 86 48 86 F7 14 01 03 2E"			= "Penerima Mel";
"06 09 2A 86 48 86 F7 14 01 02 81 71"		= "Struktur Jentera Penghantar";

"06 07 2A 86 48 86 F7 14 04"				= "Format Fail Microsoft";
"06 08 2A 86 48 86 F7 14 04 02"				= "Microsoft Word";
"06 08 2A 86 48 86 F7 14 04 03"				= "Microsoft Excel";
"06 08 2A 86 48 86 F7 14 04 04"				= "Microsoft Project";
"06 08 2A 86 48 86 F7 14 04 05"				= "Microsoft PowerPoint";
"06 08 2A 86 48 86 F7 14 04 06"				= "Microsoft Woks";

"06 08 2B 06 01 04 01 82 37 02"				= "Authenticode";
"06 0A 2B 06 01 04 01 82 37 02 01 04"		= "Maklumat Kandungan Secara Tidak Langsung SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0A"		= "Maklumat Agensi SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0B"		= "Jenis Penyataan SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0C"		= "Maklumat SPC Opus";
"06 0A 2B 06 01 04 01 82 37 02 01 0E"		= "Sambungan Sijil SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0F"		= "Data Imej SPC PE";
"06 0A 2B 06 01 04 01 82 37 02 01 14"		= "SPC Link (jenis 1)";
"06 0A 2B 06 01 04 01 82 37 02 01 15"		= "Tandatangan Kod Masing-masing";
"06 0A 2B 06 01 04 01 82 37 02 01 16"		= "Tandatangan Kod Perdagangan";
"06 0A 2B 06 01 04 01 82 37 02 01 19"		= "SPC Link (jenis 2)";
"06 0A 2B 06 01 04 01 82 37 02 01 1A"		= "Criteria minima SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 1B"		= "Criteria Kewangan SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 1C"		= "SPC Link (jenis 3)";

"06 0A 2B 06 01 04 01 82 37 02 02 0A"		= "Pembekal Penyokong Keselamatan NTLM";
"06 0A 2B 06 01 04 01 82 37 03 02 01"		= "Countersignature Stem Masa";

"06 09 2B 06 01 04 01 82 37 0A 01"			= "Senarai Sijil Trust";
"06 0A 2B 06 01 04 01 82 37 0A 01 01"		= "Sambungan Jenis CTL";
"06 09 2B 06 01 04 01 82 37 0A 02"			= "Lokasi Kemas Kini Seterusnya";

"06 09 2B 06 01 04 01 82 37 0A 03"			= "Meningkatkan Kegunaan Kunci";
"06 0A 2B 06 01 04 01 82 37 0A 03 01"		= "Senarai Tandatangan Sijil Trust";
"06 0A 2B 06 01 04 01 82 37 0A 03 02"		= "Tandatangan Stem Masa";
"06 0A 2B 06 01 04 01 82 37 0A 03 03"		= "Server Gated Crypto";
"06 0B 2B 06 01 04 01 82 37 0A 03 03 01"	= "Encryption Berserial";
"06 0A 2B 06 01 04 01 82 37 0A 03 04"		= "Sistem Fail Disulitkan";
"06 0B 2B 06 01 04 01 82 37 0A 03 04 01"	= "Pemulihan Sistem Fail Disulitkan";
"06 0A 2B 06 01 04 01 82 37 0A 03 05"		= "Serasi Hardware Windows";
"06 0A 2B 06 01 04 01 82 37 0A 03 06"		= "Tandatangan NT5";
"06 0A 2B 06 01 04 01 82 37 0A 03 07"		= "Tandatangan Windows Hardware OEM";
"06 0A 2B 06 01 04 01 82 37 0A 03 08"		= "Tandatangan NT Embedded";
"06 0A 2B 06 01 04 01 82 37 0A 03 09"		= "Senarai Tandatangan Asal Yang Dipercayai";
"06 0A 2B 06 01 04 01 82 37 0A 03 0A"		= "Subordination Disahkan";
"06 0A 2B 06 01 04 01 82 37 0A 03 0B"		= "Pemulihan Utama";
"06 0A 2B 06 01 04 01 82 37 0A 03 0C"		= "Tandatangan Dokumen";

"06 09 2B 06 01 04 01 82 37 0A 04"			= "Pengesah Sifat Objek";
"06 0A 2B 06 01 04 01 82 37 0A 04 01"		= "Sifat Kepercayaan Ya/Tidak";
"06 0A 2B 06 01 04 01 82 37 0A 05 01"		= "Microsoft Music DRM";
"06 0A 2B 06 01 04 01 82 37 0A 05 02"		= "Microsoft DRM Individualization";
"06 0A 2B 06 01 04 01 82 37 0A 06 01"		= "Lesen Microsoft";
"06 0A 2B 06 01 04 01 82 37 0A 06 02"		= "Microsoft License Server";

"06 08 2B 06 01 04 01 82 37 0D"				= "Pengecam Objek Microsoft PKCS-10";
"06 09 2B 06 01 04 01 82 37 0D 01"			= "Pembaharuan Sijil";
"06 0A 2B 06 01 04 01 82 37 0D 02 01"		= "Nama Daftaran/Nilai Pasangan";
"06 0A 2B 06 01 04 01 82 37 0D 02 02"		= "Daftaran CSP";
"06 0A 2B 06 01 04 01 82 37 0D 02 03"		= "Versi OS";
"06 08 2B 06 01 04 01 82 37 0F"				= "Microsoft Java";
"06 08 2B 06 01 04 01 82 37 10"				= "Microsoft Outlook/Exchange";
"06 09 2B 06 01 04 01 82 37 10 04"			= "Microsoft Outlook Express";
"06 08 2B 06 01 04 01 82 37 11"				= "Sifat Microsoft PKCS-12";
"06 09 2B 06 01 04 01 82 37 11 01"			= "Set Kunci Mesin Tempatan";

"06 08 2B 06 01 04 01 82 37 14"				= "Microsoft Enrollment Infrastructure";
"06 09 2B 06 01 04 01 82 37 14 01"			= "Penggunaan Auto-Enroll CTL";
"06 09 2B 06 01 04 01 82 37 14 02"			= "Sijil Mendaftar Jenis
";
"06 0A 2B 06 01 04 01 82 37 14 02 01"		= "Wakil Pendaftar";
"06 0A 2B 06 01 04 01 82 37 14 02 02"		= "Smartcard Logon";
"06 0A 2B 06 01 04 01 82 37 14 02 03"		= "Nama Prinsip NT";

"06 08 2B 06 01 04 01 82 37 15"				= "Microsoft Certificate Server Infrastructure";
"06 09 2B 06 01 04 01 82 37 15 01"			= "Pembaharuan Versi Microsoft CA";
"06 08 2B 06 01 04 01 82 37 58"				= "CAPICOM";
"06 09 2B 06 01 04 01 82 37 58 01"			= "Versi CAPICOM";
"06 09 2B 06 01 04 01 82 37 58 02"			= "Sifat CAPICOM";
"06 0A 2B 06 01 04 01 82 37 58 02 01"		= "Nama Dokumen";
"06 0A 2B 06 01 04 01 82 37 58 02 02"		= "Penjelasan Dokumen";
"06 09 2B 06 01 04 01 82 37 58 03"			= "Data Disulitkan";
"06 0A 2B 06 01 04 01 82 37 58 03 01"		= "Kandungan Disulitkan";

/* UNINETT */

"06 0A 2B 06 01 04 01 92 7C 0A 01 01"		= "Pengecam Polisi UNINETT";

/* ICE-TEL */

"06 08 2B 06 01 04 01 95 18 0A"				= "Pengecam Identiti ICE-TEL";
"06 0A 2B 06 01 04 01 95 62 01 01 01"		= "Pengecam Identiti ICE-TEL CA";

/* cryptlib */

"06 0A 2B 06 01 04 01 97 55 01 01 01"		= "Blowfish-ECB";
"06 0A 2B 06 01 04 01 97 55 01 01 02"		= "Blowfish-CBC";
"06 0A 2B 06 01 04 01 97 55 01 01 03"		= "Blowfish-CFB";
"06 0A 2B 06 01 04 01 97 55 01 01 04"		= "Blowfish-OFB";
"06 0A 2B 06 01 04 01 97 55 01 02 01"		= "ElGamal";
"06 0B 2B 06 01 04 01 97 55 01 02 01 01"	= "ElGamal dengan SHA-1";
"06 0B 2B 06 01 04 01 97 55 01 02 01 02"	= "ElGamal dengan RIPEMD-160";
"06 09 2B 06 01 04 01 97 55 03 01"			= "Sifat-sifat cryptlib";
"06 0A 2B 06 01 04 01 97 55 03 01 01"		= "Semak Kehadiran cryptlib";
"06 0A 2B 06 01 04 01 97 55 03 01 02"		= "OCSP Balasan RTCS";
"06 0A 2B 06 01 04 01 97 55 03 01 03"		= "OCSP Balasan RTCS sambungan";
"06 0A 2B 06 01 04 01 97 55 03 01 04"		= "Alasan Sambungan CRL";
"06 0A 2B 06 01 04 01 97 55 03 01 05"		= "Ciri Kunci";
"06 0A 2B 06 01 04 01 97 55 03 01 06"		= "PKI Boot";
"06 09 2B 06 01 04 01 97 55 04 01"			= "Kandungan cryptlib";
"06 0A 2B 06 01 04 01 97 55 04 01 01"		= "Pengaturan Maklumat cryptlib";
"06 0A 2B 06 01 04 01 97 55 04 01 02"		= "Indeks Pengguna cryptlib";
"06 0A 2B 06 01 04 01 97 55 04 01 03"		= "Maklumat Pengguna cryptlib";
"06 0B 2B 06 01 04 01 97 55 2A D7 24 01"	= "MPEG-1";
"06 0C 2B 06 01 04 01 97 55 58 59 5A 5A 59"	= "Pengecam Polisi XYZZY";

/* Timeproof (www.timeproof.de) */

"06 07 2B 06 01 04 01 AA 60"		= "Timeproof";
"06 08 2B 06 01 04 01 AA 60 01"		= "Masa Sistem Tandatangan";
"06 09 2B 06 01 04 01 AA 60 01 01"	= "Masa Sistem Tandatangan 80";
"06 09 2B 06 01 04 01 AA 60 01 02"	= "Masa Sistem Tandatangan 380";
"06 09 2B 06 01 04 01 AA 60 01 03"	= "Masa Sistem Tandatangan 400";

/* MEDePass */

"06 09 2B 06 01 04 01 AD 0A 00 03"  = "Langkah-Langkah Menengah";
"06 09 2B 06 01 04 01 AD 0A 00 04"  = "Pengesah-pengesah Fizikal";

/* Kerberos */

"06 05 2B 06 01 05 02"              = "Kerberos v5";
"06 06 2B 06 01 05 02 03"           = "Kerberos PKINIT";
"06 07 2B 06 01 05 02 03 01"        = "Maklumat Pengesahan Kerberos";
"06 07 2B 06 01 05 02 03 02"        = "Kunci Maklumat Kerberos Diffie-Hellman";
"06 07 2B 06 01 05 02 03 03"        = "Maklumat Kunci Ulang Balik Kerberos";
"06 07 2B 06 01 05 02 03 04"        = "Pengesahan Pelanggan Kerberos";
"06 07 2B 06 01 05 02 03 05"        = "Kerberos Key Distribution Center (KDC)";

/* IANA */

"06 06 2B 06 01 05 05 01"			= "Simple Public Key Mechanism (SPKM)";
"06 06 2B 06 01 05 05 02"			= "SPNEGO";

/* PKIX */

"06 06 2B 06 01 05 05 07"			= "Infrastructure Kunci Umum";

"06 07 2B 06 01 05 05 07 01"		= "Sambungan Sijil Peribadi PKIX";
"06 08 2B 06 01 05 05 07 01 01"		= "Akses Maklumat Autoriti Sijil";
"06 08 2B 06 01 05 05 07 01 02"		= "Maklumat Biometrik";
"06 08 2B 06 01 05 05 07 01 03"		= "Pernyataan Sijil Yang Disahkan";
"06 08 2B 06 01 05 05 07 01 04"		= "Sijil Sifat Identiti Audit";
"06 08 2B 06 01 05 05 07 01 05"		= "Sasaran Sijil Atribut";
"06 08 2B 06 01 05 05 07 01 06"		= "Attribute Certificate Authority Control";
"06 08 2B 06 01 05 05 07 01 07"		= "Blok Alamat IP SBGP";
"06 08 2B 06 01 05 05 07 01 08"		= "Pengenal Pasti Sistem Automatik SBGP";
"06 08 2B 06 01 05 05 07 01 09"		= "Pengesah Router SBGP";
"06 08 2B 06 01 05 05 07 01 0A"		= "Proksi Sijil Atribut";
"06 08 2B 06 01 05 05 07 01 0B"		= "Akses Maklumat Subjek";
"06 08 2B 06 01 05 05 07 01 0C"		= "Logotype";

"06 07 2B 06 01 05 05 07 02"		= "Jenis Dasar Kelayakan";
"06 08 2B 06 01 05 05 07 02 01"		= "Pernyataan Latihan Sijil ";
"06 08 2B 06 01 05 05 07 02 02"		= "Perhatian Pengguna";
"06 08 2B 06 01 05 05 07 02 03"		= "Notis Teks";

"06 07 2B 06 01 05 05 07 03"		= "Niat Sebenar";
"06 08 2B 06 01 05 05 07 03 01"		= "Pengesahan Pelayan";
"06 08 2B 06 01 05 05 07 03 02"		= "Pengesahan Pelanggan";
"06 08 2B 06 01 05 05 07 03 03"		= "Tandatangan Kod";
"06 08 2B 06 01 05 05 07 03 04"		= "Perlindungan E-mel";
"06 08 2B 06 01 05 05 07 03 05"		= "Tamat Sistem IPSEC";
"06 08 2B 06 01 05 05 07 03 06"		= "Terowong IPSEC";
"06 08 2B 06 01 05 05 07 03 07"		= "Pengguna IPSEC";
"06 08 2B 06 01 05 05 07 03 08"		= "Pengesteman Masa";
"06 08 2B 06 01 05 05 07 03 09"		= "Tandatangan OCSP";
"06 08 2B 06 01 05 05 07 03 0A"		= "DVCS";
"06 08 2B 06 01 05 05 07 03 0B"		= "Pengesahan Pelayan AA SBGP";

"06 07 2B 06 01 05 05 07 04"		= "Jenis Maklumat CMP";
"06 08 2B 06 01 05 05 07 04 01"		= "Sijil Protocol Encryption CA ";
"06 08 2B 06 01 05 05 07 04 02"		= "Tandatangan Kunci Jenis Berpasangan";
"06 08 2B 06 01 05 05 07 04 03"		= "Jenis Pasangan Kunci Penyulitan";
"06 08 2B 06 01 05 05 07 04 04"		= "Algoritma Bersimetri yang Diutamakan";
"06 08 2B 06 01 05 05 07 04 05"		= "Maklumat Kemas Kinian Kunci CA";
"06 08 2B 06 01 05 05 07 04 06"		= "CRL Terkini";
"06 08 2B 06 01 05 05 07 04 07"		= "OID Tidak Disokong";
"06 08 2B 06 01 05 05 07 04 08"		= "Permintaan Langganan";
"06 08 2B 06 01 05 05 07 04 09"		= "Balasan Langganan";
"06 08 2B 06 01 05 05 07 04 0A"		= "Permintaan Key Pair Parameter";
"06 08 2B 06 01 05 05 07 04 0B"		= "Balasan Key Pair Parameter";
/* %%% need to expand these labels, but can't find them documented anywhere online! */
"06 08 2B 06 01 05 05 07 04 0C"		= "revPassphrase";
"06 08 2B 06 01 05 05 07 04 0D"		= "implicitConfirm";
"06 08 2B 06 01 05 05 07 04 0E"		= "confirmWaitTime";
"06 08 2B 06 01 05 05 07 04 0F"		= "origPKIMessage";
"06 08 2B 06 01 05 05 07 04 10"		= "suppLangTags";

"06 07 2B 06 01 05 05 07 05"		= "Pendaftaran CRMF";
"06 08 2B 06 01 05 05 07 05 01"		= "Kawalan Pendaftaran";
"06 09 2B 06 01 05 05 07 05 01 01"	= "Tanda Pendaftaran";
"06 09 2B 06 01 05 05 07 05 01 02"	= "Pengesah";
"06 09 2B 06 01 05 05 07 05 01 03"	= "Maklumat Penerbitan PKI";
"06 09 2B 06 01 05 05 07 05 01 04"	= "Pilihan Archive PKI";
"06 09 2B 06 01 05 05 07 05 01 05"	= "ID Sijil ID Lama";
"06 09 2B 06 01 05 05 07 05 01 06"	= "Kunci Protocol Encryption";
"06 09 2B 06 01 05 05 07 05 01 07"	= "Template Sijil Berselang-seli";
"06 09 2B 06 01 05 05 07 05 01 08"	= "WAP WTLS Template";

"06 08 2B 06 01 05 05 07 05 02"		= "Maklumat Pendaftaran CRMF";
"06 09 2B 06 01 05 05 07 05 02 01"	= "UTF-8 Pasangan";
"06 09 2B 06 01 05 05 07 05 02 02"	= "Permintaan Sijil";

"06 07 2B 06 01 05 05 07 06"		= "Algoritma";
"06 08 2B 06 01 05 05 07 06 01"		= "DES-40";
"06 08 2B 06 01 05 05 07 06 02"		= "Tiada Tandatangan";
"06 08 2B 06 01 05 05 07 06 03"		= "dh-sig-hmac-sha1";
"06 08 2B 06 01 05 05 07 06 04"		= "dh-pop";

"06 07 2B 06 01 05 05 07 07"		= "Kawalan CMC";

"06 07 2B 06 01 05 05 07 08"		= "Nama-nama Lain";
"06 08 2B 06 01 05 05 07 08 01"		= "Malkumat Peribadi";
"06 08 2B 06 01 05 05 07 08 02"		= "Kumpulan Pengguna";

"06 07 2B 06 01 05 05 07 09"		= "Malkumat Peribadi";
"06 08 2B 06 01 05 05 07 09 01"		= "Tarikh Lahir";
"06 08 2B 06 01 05 05 07 09 02"		= "Tempat Lahir";
"06 08 2B 06 01 05 05 07 09 03"		= "Pseudonym";
"06 08 2B 06 01 05 05 07 09 04"		= "Jantina";
"06 08 2B 06 01 05 05 07 09 05"		= "Warganegara";
"06 08 2B 06 01 05 05 07 09 06"		= "Warganegara";

"06 07 2B 06 01 05 05 07 0A"		= "Sijil Sifat";
"06 08 2B 06 01 05 05 07 0A 01"		= "Maklumat Pengesahan";
"06 08 2B 06 01 05 05 07 0A 02"		= "Identiti Kemasukan";
"06 08 2B 06 01 05 05 07 0A 03"		= "Mengubah Identiti";
"06 08 2B 06 01 05 05 07 0A 04"		= "Kumpulan";
"06 08 2B 06 01 05 05 07 0A 05"		= "Peranan";
"06 08 2B 06 01 05 05 07 0A 06"		= "WLAN SSID";

/* OCSP */

"06 08 2B 06 01 05 05 07 30 01"		= "Status Protocol Sijil Online";
"06 09 2B 06 01 05 05 07 30 01 01"	= "Balasan asas OCSP";
"06 09 2B 06 01 05 05 07 30 01 02"	= "Sambungan OCSP Nonce";
"06 09 2B 06 01 05 05 07 30 01 03"	= "Rujukan OCSP CRL";
"06 09 2B 06 01 05 05 07 30 01 04"	= "Balasan OCSP";
"06 09 2B 06 01 05 05 07 30 01 05"	= "Tiada Semakan Pembatalan OCSP";
"06 09 2B 06 01 05 05 07 30 01 06"	= "OCSP Archive Cutoff";
"06 09 2B 06 01 05 05 07 30 01 07"	= "Pencari Khidmat OCSP";

"06 08 2B 06 01 05 05 07 30 02"		= "Pengeluar-pengeluar CA";
"06 08 2B 06 01 05 05 07 30 03"		= "Pengesteman Masa";

/* ISAKMP */

"06 08 2B 06 01 05 05 08 01 01"		= "HMAC MD5";
"06 08 2B 06 01 05 05 08 01 02"		= "HMAC SHA-1";
"06 08 2B 06 01 05 05 08 01 03"		= "HMAC Tiger";
"06 08 2B 06 01 05 05 08 02 02"		= "IKE Intermediate";

/* DEC (via ECMA) */

"06 07 2B 0C 02 87 73 07 01"		= "Algoritma Enkripsi DEC";
"06 08 2B 0C 02 87 73 07 01 02"		= "DEC DEA";
"06 07 2B 0C 02 87 73 07 02"		= "Algoritma Hash DEC";
"06 07 2B 0C 02 87 73 07 02 01"		= "DEC MD2";
"06 07 2B 0C 02 87 73 07 02 02"		= "DEC MD4";
"06 07 2B 0C 02 87 73 07 03"		= "Algoritma Tandatangan DEC";
"06 07 2B 0C 02 87 73 07 03 01"		= "DEC MD2 dengan RSA";
"06 07 2B 0C 02 87 73 07 03 02"		= "DEC MD4 dengan RSA";
"06 07 2B 0C 02 87 73 07 03 03"		= "DEC DEA-MAC";

/* NIST Open Systems Environment (OSE) Implementor's Workshop (OIW) */

"06 05 2B 0E 02 1A 05"				= "SHA";
"06 06 2B 0E 03 02 01 01"			= "RSA";
"06 05 2B 0E 03 02 02"				= "MD4 dengan RSA";
"06 05 2B 0E 03 02 03"				= "MD5 dengan RSA";
"06 05 2B 0E 03 02 04"				= "MD4 dengan Encryption RSA";
"06 06 2B 0E 03 02 02 01"			= "SqMod-N";
"06 06 2B 0E 03 02 03 01"			= "SqMod-N dengan RSA";
"06 05 2B 0E 03 02 06"				= "DES-ECB";
"06 05 2B 0E 03 02 07"				= "DES-CBC";
"06 05 2B 0E 03 02 08"				= "DES-OFB";
"06 05 2B 0E 03 02 09"				= "DES-CFB";
"06 05 2B 0E 03 02 0A"				= "DES-MAC";
"06 05 2B 0E 03 02 0B"				= "Tandatangan RSA";
"06 05 2B 0E 03 02 0C"				= "DSA";
"06 05 2B 0E 03 02 0D"				= "DSA dengan SHA";
"06 05 2B 0E 03 02 0E"				= "MDC2 dengan Tandatangan RSA";
"06 05 2B 0E 03 02 0F"				= "SHA dengan Tandatangan RSA";
"06 05 2B 0E 03 02 10"				= "Diffie-Hellman dengan Modulus Biasa";
"06 05 2B 0E 03 02 11"				= "DES-EDE";
"06 05 2B 0E 03 02 12"				= "SHA";
"06 05 2B 0E 03 02 13"				= "MDC-2";
"06 05 2B 0E 03 02 14"				= "DSA Biasa";
"06 05 2B 0E 03 02 15"				= "DSA Biasa Dengan SHA";
"06 05 2B 0E 03 02 16"				= "Kunci Pengangkutan RSA";
"06 05 2B 0E 03 02 17"				= "Keyed-hash-seal";
"06 05 2B 0E 03 02 18"				= "MD2 dengan Tandatangan RSA";
"06 05 2B 0E 03 02 19"				= "MD5 dengan Tandatangan RSA";
"06 05 2B 0E 03 02 1A"				= "SHA-1";
"06 05 2B 0E 03 02 1B"				= "DSA dengan SHA-1";
"06 05 2B 0E 03 02 1C"				= "DSA dengan SHA-1 Umum";
"06 05 2B 0E 03 02 1D"				= "SHA-1 dengan Encryption RSA";
"06 05 2B 0E 03 03 01"				= "Simple-strong-auth-mechanism";
"06 06 2B 0E 07 02 01 01"			= "ElGamal";
"06 06 2B 0E 07 02 03 01"			= "MD2 dengan RSA";
"06 06 2B 0E 07 02 03 02"			= "MD2 dengan ElGamal";

/* Teletrust */

"06 03 2B 24 01"					= "Dokumen";
"06 04 2B 24 01 01"					= "Versi Terakhir";
"06 04 2B 24 01 02"					= "Draf";
"06 03 2B 24 02"					= "SIO";
"06 04 2B 24 02 01"					= "SEDU";

"06 03 2B 24 03"					= "Algoritma";
"06 04 2B 24 03 01"					= "Algoritma Penyulitan";
"06 05 2B 24 03 01 01"				= "DES";
"06 06 2B 24 03 01 01 01"			= "DES-ECB Pad";
"06 07 2B 24 03 01 01 01 01"		= "DES-ECB ISO Pad";
"06 07 2B 24 03 01 01 02 01"		= "DES-CBC Pad";
"06 08 2B 24 03 01 01 02 01 01"		= "DES-CBC ISO Pad";
"06 05 2B 24 03 01 03"				= "DES3";
"06 07 2B 24 03 01 03 01 01"		= "DES3-ECB Pad";
"06 08 2B 24 03 01 03 01 01 01"		= "DES3-ECB ISO Pad";
"06 07 2B 24 03 01 03 02 01"		= "DES3-CBC Pad";
"06 08 2B 24 03 01 03 02 01 01"		= "DES3-CBC ISO Pad";
"06 05 2B 24 03 01 02"				= "IDEA";
"06 06 2B 24 03 01 02 01"			= "IDEA-ECB";
"06 07 2B 24 03 01 02 01 01"		= "IIDEA-ECB Pad";
"06 08 2B 24 03 01 02 01 01 01"		= "IDEA-ECB ISO Pad";
"06 06 2B 24 03 01 02 02"			= "IDEA-CBC";
"06 07 2B 24 03 01 02 02 01"		= "IDEA-CBC Pad";
"06 08 2B 24 03 01 02 02 01 01"		= "IDEA-CBC ISO Pad";
"06 06 2B 24 03 01 02 03"			= "IDEA-OFB";
"06 06 2B 24 03 01 02 04"			= "IDEA-CFB";
"06 05 2B 24 03 01 04"				= "RSA Encryption";
"06 05 2B 24 03 01 05"				= "BSI-1";
"06 06 2B 24 03 01 05 01"			= "BSI-1-ECB Pad";
"06 06 2B 24 03 01 05 02"			= "BSI-1-CBC Pad";
"06 07 2B 24 03 01 05 02 01"		= "BSI-1-CBC PEM Pad";

"06 04 2B 24 03 02"					= "Algoritma Hash";
"06 05 2B 24 03 02 01"				= "RIPEMD-160";
"06 05 2B 24 03 02 02"				= "RIPEMD-128";
"06 05 2B 24 03 02 03"				= "RIPEMD-256";
"06 05 2B 24 03 02 04"				= "MDC2 Satu Kali Ganda Panjang";
"06 05 2B 24 03 02 05"				= "MDC2 Dua Kali Ganda Panjang";
"06 04 2B 24 03 03"					= "Algoritma Tandatangan";
"06 05 2B 24 03 03 01"				= "Tandatangan RSA";

"06 06 2B 24 03 03 01 01"			= "Tandatangan RSA dengan SHA-1";
"06 09 2B 24 03 03 01 01 84 00 02"	= "Tandatangan RSA dengan SHA-1 512/L2";
"06 09 2B 24 03 03 01 01 85 00 02"	= "Tandatangan RSA dengan SHA-1 640/L2";
"06 09 2B 24 03 03 01 01 86 00 02"	= "Tandatangan RSA dengan SHA-1 768/L2";
"06 09 2B 24 03 03 01 01 87 00 02"	= "Tandatangan RSA dengan SHA-1 896/L2";
"06 09 2B 24 03 03 01 01 88 00 02"	= "Tandatangan RSA dengan SHA-1 1024/L2";
"06 09 2B 24 03 03 01 01 84 00 03"	= "Tandatangan RSA dengan SHA-1 512/L3";
"06 09 2B 24 03 03 01 01 85 00 03"	= "Tandatangan RSA dengan SHA-1 640/L3";
"06 09 2B 24 03 03 01 01 86 00 03"	= "Tandatangan RSA dengan SHA-1 768/L3";
"06 09 2B 24 03 03 01 01 87 00 03"	= "Tandatangan RSA dengan SHA-1 896/L3";
"06 09 2B 24 03 03 01 01 88 00 03"	= "Tandatangan RSA dengan SHA-1 1024/L3";
"06 09 2B 24 03 03 01 01 84 00 05"	= "Tandatangan RSA dengan SHA-1 512/L5";
"06 09 2B 24 03 03 01 01 85 00 05"	= "Tandatangan RSA dengan SHA-1 640/L5";
"06 09 2B 24 03 03 01 01 86 00 05"	= "Tandatangan RSA dengan SHA-1 768/L5";
"06 09 2B 24 03 03 01 01 87 00 05"	= "Tandatangan RSA dengan SHA-1 896/L5";
"06 09 2B 24 03 03 01 01 88 00 05"	= "Tandatangan RSA dengan SHA-1 1024/L5";
"06 09 2B 24 03 03 01 01 84 00 09"	= "Tandatangan RSA dengan SHA-1 512/L9";
"06 09 2B 24 03 03 01 01 85 00 09"	= "Tandatangan RSA dengan SHA-1 640/L9";
"06 09 2B 24 03 03 01 01 86 00 09"	= "Tandatangan RSA dengan SHA-1 768/L9";
"06 09 2B 24 03 03 01 01 87 00 09"	= "Tandatangan RSA dengan SHA-1 896/L9";
"06 09 2B 24 03 03 01 01 88 00 09"	= "Tandatangan RSA dengan SHA-1 1024/L9";
"06 09 2B 24 03 03 01 01 84 00 11"	= "Tandatangan RSA dengan SHA-1 512/L11";
"06 09 2B 24 03 03 01 01 85 00 11"	= "Tandatangan RSA dengan SHA-1 640/L11";
"06 09 2B 24 03 03 01 01 86 00 11"	= "Tandatangan RSA dengan SHA-1 768/L11";
"06 09 2B 24 03 03 01 01 87 00 11"	= "Tandatangan RSA dengan SHA-1 896/L11";
"06 09 2B 24 03 03 01 01 88 00 11"	= "Tandatangan RSA dengan SHA-1 1024/L11";

"06 06 2B 24 03 03 01 02"			= "Tandatangan RSA dengan RIPEMD-160";
"06 09 2B 24 03 03 01 02 84 00 02"	= "Tandatangan RSA dengan RIPEMD-160 512/L2";
"06 09 2B 24 03 03 01 02 85 00 02"	= "Tandatangan RSA dengan RIPEMD-160 640/L2";
"06 09 2B 24 03 03 01 02 86 00 02"	= "Tandatangan RSA dengan RIPEMD-160 768/L2";
"06 09 2B 24 03 03 01 02 87 00 02"	= "Tandatangan RSA dengan RIPEMD-160 896/L2";
"06 09 2B 24 03 03 01 02 88 00 02"	= "Tandatangan RSA dengan RIPEMD-160 1024/L2";
"06 09 2B 24 03 03 01 02 84 00 03"	= "Tandatangan RSA dengan RIPEMD-160 512/L3";
"06 09 2B 24 03 03 01 02 85 00 03"	= "Tandatangan RSA dengan RIPEMD-160 640/L3";
"06 09 2B 24 03 03 01 02 86 00 03"	= "Tandatangan RSA dengan RIPEMD-160 768/L3";
"06 09 2B 24 03 03 01 02 87 00 03"	= "Tandatangan RSA dengan RIPEMD-160 896/L3";
"06 09 2B 24 03 03 01 02 88 00 03"	= "Tandatangan RSA dengan RIPEMD-160 1024/L3";
"06 09 2B 24 03 03 01 02 84 00 05"	= "Tandatangan RSA dengan RIPEMD-160 512/L5";
"06 09 2B 24 03 03 01 02 85 00 05"	= "Tandatangan RSA dengan RIPEMD-160 640/L5";
"06 09 2B 24 03 03 01 02 86 00 05"	= "Tandatangan RSA dengan RIPEMD-160 768/L5";
"06 09 2B 24 03 03 01 02 87 00 05"	= "Tandatangan RSA dengan RIPEMD-160 896/L5";
"06 09 2B 24 03 03 01 02 88 00 05"	= "Tandatangan RSA dengan RIPEMD-160 1024/L5";
"06 09 2B 24 03 03 01 02 84 00 09"	= "Tandatangan RSA dengan RIPEMD-160 512/L9";
"06 09 2B 24 03 03 01 02 85 00 09"	= "Tandatangan RSA dengan RIPEMD-160 640/L9";
"06 09 2B 24 03 03 01 02 86 00 09"	= "Tandatangan RSA dengan RIPEMD-160 768/L9";
"06 09 2B 24 03 03 01 02 87 00 09"	= "Tandatangan RSA dengan RIPEMD-160 896/L9";
"06 09 2B 24 03 03 01 02 88 00 09"	= "Tandatangan RSA dengan RIPEMD-160 1024/L9";
"06 09 2B 24 03 03 01 02 84 00 11"	= "Tandatangan RSA dengan RIPEMD-160 512/L11";
"06 09 2B 24 03 03 01 02 85 00 11"	= "Tandatangan RSA dengan RIPEMD-160 640/L11";
"06 09 2B 24 03 03 01 02 86 00 11"	= "Tandatangan RSA dengan RIPEMD-160 768/L11";
"06 09 2B 24 03 03 01 02 87 00 11"	= "Tandatangan RSA dengan RIPEMD-160 896/L11";
"06 09 2B 24 03 03 01 02 88 00 11"	= "Tandatangan RSA dengan RIPEMD-160 1024/L11";

"06 06 2B 24 03 03 01 03"			= "Tandatangan RSA dengan RIPEMD-128";
"06 06 2B 24 03 03 01 04"			= "Tandatangan RSA dengan RIPEMD-256";

"06 05 2B 24 03 03 02"				= "Tandatangan ECSIE";
"06 06 2B 24 03 03 02 01"			= "Tandatangan ECSIE dengan SHA-1";
"06 06 2B 24 03 03 02 02"			= "Tandatangan ECSIE dengan RIPEMD-160";
"06 06 2B 24 03 03 02 03"			= "Tandatangan ECSIE dengan MD2";
"06 06 2B 24 03 03 02 04"			= "Tandatangan ECSIE dengan MD5";

"06 04 2B 24 03 04"					= "Skim Tandatangan";
"06 05 2B 24 03 04 01"				= "ISO9796-1";
"06 05 2B 24 03 04 02"				= "ISO9796-2";
"06 05 2B 24 03 04 02 01"			= "ISO9796-2 dengan RED";
"06 06 2B 24 03 04 02 02"			= "ISO9796-2 dengan RSA";
"06 06 2B 24 03 04 02 03"			= "ISO9796-2 dengan RND";

"06 03 2B 24 04"					= "Sifat";
"06 03 2B 24 05"					= "Polisi";
"06 03 2B 24 06"					= "API";
"06 04 2B 24 06 01"					= "Manufacturer-Specific API";
"06 05 2B 24 06 01 01"				= "UTIMACO-API";
"06 04 2B 24 06 02"					= "Functionality-Specific API";
"06 03 2B 24 07"					= "Pengurusan Kunci";
"06 04 2B 24 07 01"					= "Kunci Persetujuan";
"06 05 2B 24 07 01 01"				= "BSI PKE";
"06 04 2B 24 07 02"					= "Pindahan Kunci";
"06 05 2B 24 07 02 01"				= "ISO9796-2 dengan Encryption RSA";

"06 05 2B 24 08 01 01"				= "Pengecam Polisi Teletrust SigiSigConform";
"06 05 2B 24 08 02 01"				= "Perkhidmatan Direktori";

"06 05 2B 24 08 03 01"				= "Tarikh Sijil Generasi";
"06 05 2B 24 08 03 02"				= "Procuration";
"06 05 2B 24 08 03 03"				= "Kemasukkan";
"06 05 2B 24 08 03 04"				= "Batasan Monetary";
"06 05 2B 24 08 03 05"				= "Kebanyakan dari Pernyataan";
"06 05 2B 24 08 03 06"				= "Nombor Serial Integrated Circuit Card";
"06 05 2B 24 08 03 07"				= "Rujukan Kunci Awam";
"06 05 2B 24 08 03 08"				= "Pengehadan";
"06 05 2B 24 08 03 09"				= "Ambil Jika Dibenarkan";
"06 05 2B 24 08 03 0A"				= "Permintaan Sijil";
"06 05 2B 24 08 03 0B"				= "Jawatan Kuasa Pernamaan";
"06 05 2B 24 08 03 0C"				= "Sijil Di direktori Sejak";
"06 05 2B 24 08 03 0D"				= "Cincangan Sijil";

"06 05 2B 24 08 04 01"				= "Malkumat Peribadi";
"06 05 2B 24 08 04 08"				= "Pengehadan";
"06 07 2B 24 08 05 01 01 01"		= "RSA menunjukkan SHA-1";
"06 07 2B 24 08 05 01 01 02"		= "RSA menunjukkan RIPEMD-160";
"06 07 2B 24 08 05 01 01 03"		= "RSA dengan SHA-1";
"06 07 2B 24 08 05 01 01 04"		= "RSA dengan RIPEMD-160";
"06 07 2B 24 08 05 01 02 01"		= "DSA Disambung";
"06 07 2B 24 08 05 01 02 02"		= "DSA dengan RIPEMD-160";

"06 05 2B 24 08 06 01"				= "Sijil";
"06 05 2B 24 08 06 02"				= "Rujukan Sijil";
"06 05 2B 24 08 06 03"				= "Sijil Sifat";
"06 05 2B 24 08 06 04"				= "Rujukan Sifat";
"06 05 2B 24 08 06 05"				= "Nama Fail";
"06 05 2B 24 08 06 06"				= "Masa Simpanan";
"06 05 2B 24 08 06 07"				= "Saiz Fail";
"06 05 2B 24 08 06 08"				= "Lokasi";
"06 05 2B 24 08 06 09"				= "Nombor Tandatangan";
"06 05 2B 24 08 06 0A"				= "Autogenerated";

"06 05 2B 24 08 07 01"				= "Jenis Pertunjukkan Teletrust";
"06 06 2B 24 08 07 01 01"			= "Adobe Illustrator";
"06 06 2B 24 08 07 01 02"			= "AmiPro";
"06 06 2B 24 08 07 01 03"			= "AutoCAD";
"06 06 2B 24 08 07 01 04"			= "Binary";
"06 06 2B 24 08 07 01 05"			= "BMP";
"06 06 2B 24 08 07 01 06"			= "CGM";
"06 06 2B 24 08 07 01 07"			= "CorelCRT";
"06 06 2B 24 08 07 01 08"			= "CorelDRW";
"06 06 2B 24 08 07 01 09"			= "CorelEXC";
"06 06 2B 24 08 07 01 0A"			= "CorelPHT";
"06 06 2B 24 08 07 01 0B"			= "Lukis";
"06 06 2B 24 08 07 01 0C"			= "DVI";
"06 06 2B 24 08 07 01 0D"			= "EPS";
"06 06 2B 24 08 07 01 0E"			= "Excel";
"06 06 2B 24 08 07 01 0F"			= "GEM";
"06 06 2B 24 08 07 01 10"			= "GIF";
"06 06 2B 24 08 07 01 11"			= "HPGL";
"06 06 2B 24 08 07 01 12"			= "JPEG";
"06 06 2B 24 08 07 01 13"			= "Kodak";
"06 06 2B 24 08 07 01 14"			= "LaTeX";
"06 06 2B 24 08 07 01 15"			= "Lotus";
"06 06 2B 24 08 07 01 16"			= "LotusPIC";
"06 06 2B 24 08 07 01 17"			= "MacPICT";
"06 06 2B 24 08 07 01 18"			= "MacWord";
"06 06 2B 24 08 07 01 19"			= "MSWfD";
"06 06 2B 24 08 07 01 1A"			= "MSWord";
"06 06 2B 24 08 07 01 1B"			= "MSWord2";
"06 06 2B 24 08 07 01 1C"			= "MSWord6";
"06 06 2B 24 08 07 01 1D"			= "MSWord8";
"06 06 2B 24 08 07 01 1E"			= "PDF";
"06 06 2B 24 08 07 01 1F"			= "PIF";
"06 06 2B 24 08 07 01 20"			= "Postscript";
"06 06 2B 24 08 07 01 21"			= "RTF";
"06 06 2B 24 08 07 01 22"			= "SCITEX";
"06 06 2B 24 08 07 01 23"			= "TAR";
"06 06 2B 24 08 07 01 24"			= "Targa";
"06 06 2B 24 08 07 01 25"			= "TeX";
"06 06 2B 24 08 07 01 26"			= "Teks";
"06 06 2B 24 08 07 01 27"			= "TIFF";
"06 06 2B 24 08 07 01 28"			= "TIFF-FC";
"06 06 2B 24 08 07 01 29"			= "UID";
"06 06 2B 24 08 07 01 2A"			= "UUEncode";
"06 06 2B 24 08 07 01 2B"			= "WMF";
"06 06 2B 24 08 07 01 2C"			= "WordPerfect";
"06 06 2B 24 08 07 01 2D"			= "WPGrph";

/* Thawte */

"06 04 2B 65 01 04"					= "Sambungan Sijil Thawte";
"06 05 2B 65 01 04 01"				= "Extranet Kuat";

/* X.520 */

"06 02 55 04"		= "X.520 Jenis Sifat";
"06 03 55 04 00"	= "Kelas Objek";
"06 03 55 04 01"	= "Nama Masukan Beralias";
"06 03 55 04 02"	= "Maklumat Pengetahuan";
"06 03 55 04 03"	= "Nama Umum";
"06 03 55 04 04"	= "Nama Keluarga";
"06 03 55 04 05"	= "Nombor Serial";
"06 03 55 04 06"	= "Nama Negeri";
"06 03 55 04 07"	= "Nama Tempatan";
"06 04 55 04 07 01"	= "Pengumpulan Nama Tempatan";
"06 03 55 04 08"	= "Negara atau Nama Daerah";
"06 04 55 04 08 01"	= "Penggumpulan Negara atau Nama Daerah";
"06 03 55 04 09"	= "Alamat Jalan";
"06 04 55 04 09 01"	= "Penggumpulan Alamat Jalan";
"06 03 55 04 0A"	= "Nama Pertubuhan";
"06 04 55 04 0A 01"	= "Pengumpulan Nama Pertubuhan";
"06 03 55 04 0B"	= "Nama Unit Pertubuhan";
"06 04 55 04 0B 01"	= "Pengumpulan Nama Unit Pertubuhan";
"06 03 55 04 0C"	= "Tajuk";
"06 03 55 04 0D"	= "Butiran";
"06 03 55 04 0E"	= "Panduan Pencari";
"06 03 55 04 0F"	= "Kategori Bisnes";
"06 03 55 04 10"	= "Alamat Pos";
"06 04 55 04 10 01"	= "Penggumpulan Alamat Pos";
"06 03 55 04 11"	= "Poskod";
"06 04 55 04 11 01"	= "Penggumpulan Poskod";
"06 03 55 04 12"	= "Kotak Pejabat Pos";
"06 04 55 04 12 01"	= "Pengumpulan Peti Pejabat Pos";
"06 03 55 04 13"	= "Nama Pejabat Penghantar yang Fizikal";
"06 04 55 04 13 01"	= "Pengumpulan Nama Pejabat Penghantar yang Fizikal";
"06 03 55 04 14"	= "Nombor Telefon";
"06 04 55 04 14 01"	= "Pengumpulan Nombor Telefon";
"06 03 55 04 15"	= "Nombor Telex";
"06 04 55 04 15 01"	= "Pengumpulan Nombor Telex";
"06 03 55 04 16"	= "Pengecam Terminal Teletex";
"06 04 55 04 16 01"	= "Pengecam Terminal Teletex Collective";
"06 03 55 04 17"	= "Nombor Telefon Facsimile";
"06 04 55 04 17 01"	= "Pengumpulan Nombor Telefon Facsimile";
"06 03 55 04 18"	= "X.121 Alamat";
"06 03 55 04 19"	= "Nombor ISDN Antarabangsa";
"06 04 55 04 19 01"	= "Pengumpulan Nombor ISDN Antarabangsa";
"06 03 55 04 1A"	= "Alamat Yang Didaftar";
"06 03 55 04 1B"	= "Penanda Destinasi";
"06 03 55 04 1C"	= "Kaedah Penghantaran Diutamakan";
"06 03 55 04 1D"	= "Alamat Persembahan";
"06 03 55 04 1E"	= "Kandungan Aplikasi Disokong";
"06 03 55 04 1F"	= "Ahli";
"06 03 55 04 20"	= "Pemilik";
"06 03 55 04 21"	= "Peranan Penghuni";
"06 03 55 04 22"	= "Tengok Juga";
"06 03 55 04 23"	= "Kata Laluan Pengguna";
"06 03 55 04 24"	= "Gunakan Sijil";
"06 03 55 04 25"	= "Sijil CA";
"06 03 55 04 26"	= "Senarai Pembatalan Autoriti";
"06 03 55 04 27"	= "Senarai Pembatalan Sijil";
"06 03 55 04 28"	= "Cross Certificate Pair";
"06 03 55 04 29"	= "Nama";
"06 03 55 04 2A"	= "Nama yang Diberi";
"06 03 55 04 2B"	= "Tandatangan";
"06 03 55 04 2C"	= "Pengesah Generasi";
"06 03 55 04 2D"	= "Pengecam Istimewa";
"06 03 55 04 2E"	= "Kelayakan DN";
"06 03 55 04 2F"	= "Panduan Pencari Ditingkatkan";
"06 03 55 04 30"	= "Maklumat Protokol";
"06 03 55 04 31"	= "Membezekan Nama";
"06 03 55 04 32"	= "Ahli Istimewa";
"06 03 55 04 33"	= "Pengecam Rumah";
"06 03 55 04 34"	= "Algoritma Disokong";
"06 03 55 04 35"	= "Senarai Pembatalan Delta";
"06 03 55 04 36"	= "Pembersihan";
"06 03 55 04 3A"	= "Cross Certificate Pair";

/* X.500 object classes */

"06 02 55 06"		= "X.520 Kelas Objek";
"06 03 55 06 00"	= "Atas";
"06 03 55 06 01"	= "Alias";
"06 03 55 06 02"	= "Negeri";
"06 03 55 06 03"	= "Penempatan";
"06 03 55 06 04"	= "Pertubuhan";
"06 03 55 06 05"	= "Unit Pertubuhan";
"06 03 55 06 06"	= "Orang";
"06 03 55 06 07"	= "Ahli Pertubuhan";
"06 03 55 06 08"	= "Peranan Pertubuhan";
"06 03 55 06 09"	= "Kumpulan Nama";
"06 03 55 06 0A"	= "Penduduk";
"06 03 55 06 0B"	= "Proses Aplikasi";
"06 03 55 06 0C"	= "Entity Aplikasi";
"06 03 55 06 0D"	= "DSA";
"06 03 55 06 0E"	= "Peranti";
"06 03 55 06 0F"	= "Pengguna Pengesahan  Kuat";
"06 03 55 06 10"	= "Pihak Berkuasa Sijil";
"06 03 55 06 11"	= "Kumpulan Nama Istimewa";
"06 03 55 06 15"	= "Pengguna PKI";
"06 03 55 06 16"	= "PKI CA";

/* X.500 algorithms */

"06 02 55 08"		= "Algoritma X.500";
"06 03 55 08 01"	= "Algoritma Enkripsi X.500";
"06 04 55 08 01 01"	= "RSA";

/* X.509 */

"06 02 55 1D"		= "Sambungan Sijil X.509 ";
"06 03 55 1D 01"	= "Pengenalpasti Kunci Autoriti (lama)";
"06 03 55 1D 02"	= "Sifat Kunci Utama (lama)";
"06 03 55 1D 03"	= "Polisi Sijil (lama)";
"06 03 55 1D 04"	= "Pengehadan Penggunaan Kunci (lama)";
"06 03 55 1D 05"	= "Dasar Pemetaan (lama)";
"06 03 55 1D 06"	= "Pemaksaan Subtrees";
"06 03 55 1D 07"	= "Nama Lain Subjek (lama)";
"06 03 55 1D 08"	= "Nama Lain Pengeluar (lama)";
"06 03 55 1D 09"	= "Sifat Direktori Subjek";
"06 03 55 1D 0A"	= "Kekangan Biasa (lama 2.5.29.10)";
"06 03 55 1D 0B"	= "Batasan Nama (lama)";
"06 03 55 1D 0C"	= "Batasan Polisi (lama)";
"06 03 55 1D 0D"	= "Kekangan Biasa (lama 2.5.29.13)";
"06 03 55 1D 0E"	= "Pengenalpasti Kunci Subjek";
"06 03 55 1D 0F"	= "Kegunaan Utama";
"06 03 55 1D 10"	= "Tempoh Kegunaan Kunci Peribadi";
"06 03 55 1D 11"	= "Nama Lain Subjek";
"06 03 55 1D 12"	= "Nama Lain Pengeluar";
"06 03 55 1D 13"	= "Kekangan Biasa";
"06 03 55 1D 14"	= "Nombor Senarai Pembatalan Sijil";
"06 03 55 1D 15"	= "Kod Alasan CRL";
"06 03 55 1D 16"	= "Tarikh Luput (lama)";
"06 03 55 1D 17"	= "Pegang Kod Arahan";
"06 03 55 1D 18"	= "Tarikh Tidak Sah";
"06 03 55 1D 19"	= "Titik Pembahagian CRL (lama)";
"06 03 55 1D 1A"	= "Mengeluarkan Titik Pembahagian (lama)";
"06 03 55 1D 1B"	= "Penunjuk Delta CRL";
"06 03 55 1D 1C"	= "Mengeluarkan Titik Pembahagian";
"06 03 55 1D 1D"	= "Pengeluar Sijil";
"06 03 55 1D 1E"	= "Batasan Nama";
"06 03 55 1D 1F"	= "Titik Pembahagian CRL";
"06 03 55 1D 20"	= "Polisi Sijil";
"06 04 55 1D 20 00"	= "Apa-apa Pengecam Polisi";
"06 03 55 1D 21"	= "Dasar Pemetaan";
"06 03 55 1D 22"	= "Batasan Polisi";
"06 03 55 1D 23"	= "Pengenalpasti Kunci Autoriti";
"06 03 55 1D 24"	= "Batasan Polisi";
"06 03 55 1D 25"	= "Kegunaan Kunci Tambahan";
"06 04 55 1D 25 00"	= "Sebarang Kegunaan Kunci Tambahan";

/* DMS - SDN.700 INFOSEC algorithms */

"06 09 60 86 48 01 65 02 01 01 01"	= "Algoritma Tandatangan SDNS";
"06 09 60 86 48 01 65 02 01 01 02"	= "Algoritma Tandatangan Fortezza";
"06 09 60 86 48 01 65 02 01 01 03"	= "Algoritma Sulit SDNS";
"06 09 60 86 48 01 65 02 01 01 04"	= "Algoritma Sulit Fortezza";
"06 09 60 86 48 01 65 02 01 01 05"	= "Algoritma Integriti SDNS";
"06 09 60 86 48 01 65 02 01 01 06"	= "Algoritma Integriti Fortezza";
"06 09 60 86 48 01 65 02 01 01 07"	= "Algoritma Perlindungan Token SDNS";
"06 09 60 86 48 01 65 02 01 01 08"	= "Algoritma Perlindungan Token Fortezza";
"06 09 60 86 48 01 65 02 01 01 09"	= "Algoritma Pengurusan Kunci SDNS";
"06 09 60 86 48 01 65 02 01 01 0A"	= "Algoritma Pengurusan Kunci Fortezza";
"06 09 60 86 48 01 65 02 01 01 0B"	= "Algoritma Tandatangan dan Pengurusan Kunci SDNS";
"06 09 60 86 48 01 65 02 01 01 0C"	= "Algoritma Pengurusan dan Tandatangan Kunci Fortezza";
"06 09 60 86 48 01 65 02 01 01 0D"	= "Algoritma Tandatangan Suite A";
"06 09 60 86 48 01 65 02 01 01 0E"	= "Algoritma Sulit Suite A";
"06 09 60 86 48 01 65 02 01 01 0F"	= "Algoritma Integriti Suite A";
"06 09 60 86 48 01 65 02 01 01 10"	= "Algoritma Perlindungan Token Suite A";
"06 09 60 86 48 01 65 02 01 01 11"	= "Algoritma Pengurusan Kunci Suite A";
"06 09 60 86 48 01 65 02 01 01 12"	= "Algoritma Tandatangan dan Pengurusan Kunci Suite A";
"06 09 60 86 48 01 65 02 01 01 13"	= "Algoritma Tandatangan Dikemas Kini Fortezza";
"06 09 60 86 48 01 65 02 01 01 14"	= "Algoritma Pengurusan Kunci dan Tandatangan Dikemas Kini Fortezza";
"06 09 60 86 48 01 65 02 01 01 15"	= "Algoritma Integriti Dikemas Kini Fortezza";
"06 09 60 86 48 01 65 02 01 01 16"	= "Algoritma Pertukaran Kunci";
"06 09 60 86 48 01 65 02 01 01 17"	= "Algoritma Wrap80 Fortezza";
"06 09 60 86 48 01 65 02 01 01 18"	= "Algoritma Enkripsi Kunci (KEA)";

"06 09 60 86 48 01 65 02 01 02 01"	= "RFC 822 Format Mesej";
"06 09 60 86 48 01 65 02 01 02 02"	= "Kandungan Kosong";
"06 09 60 86 48 01 65 02 01 02 03"	= "Jenis Kandungan CSP";
"06 09 60 86 48 01 65 02 01 02 2A"	= "Jenis Kandungan MSP Rev 3";
"06 09 60 86 48 01 65 02 01 02 30"	= "Jenis Kandungan MSP";
"06 09 60 86 48 01 65 02 01 02 31"	= "Protocol Agen MSP Rekey";
"06 09 60 86 48 01 65 02 01 02 32"	= "MSP MMP";
"06 09 60 86 48 01 65 02 01 02 42"	= "Jenis Kandungan MSP Rev 3.1";
"06 09 60 86 48 01 65 02 01 02 48"	= "Lanjutan Mesej MSP Bahagian";
"06 09 60 86 48 01 65 02 01 02 49"	= "Parameter Lanjutan Mesej MSP";
"06 09 60 86 48 01 65 02 01 02 50"	= "Lanjutan Mesej CSP Bahagian";
"06 09 60 86 48 01 65 02 01 02 51"	= "Parameter Mesej Lanjutan CSP";
"06 09 60 86 48 01 65 02 01 02 52"	= "MSP MMP2";

/* SDN.700 INFOSEC policy */

"06 09 60 86 48 01 65 02 01 03 01"		= "Polisi Keselamatan SDNS";
"06 09 60 86 48 01 65 02 01 03 02"		= "SDNS PRBAC";
"06 09 60 86 48 01 65 02 01 03 03"		= "Mosaic PRBAC";

"06 09 60 86 48 01 65 02 01 03 0A"		= "Polisi Keselamatan";
"06 0A 60 86 48 01 65 02 01 03 0A 00"	= "NASP";
"06 0A 60 86 48 01 65 02 01 03 0A 01"	= "ELCO";
"06 0A 60 86 48 01 65 02 01 03 0A 02"	= "TK";
"06 0A 60 86 48 01 65 02 01 03 0A 03"	= "DSAP";
"06 0A 60 86 48 01 65 02 01 03 0A 04"	= "SSSS";
"06 0A 60 86 48 01 65 02 01 03 0A 05"	= "DNASP";
"06 0A 60 86 48 01 65 02 01 03 0A 06"	= "BYEMAN";
"06 0A 60 86 48 01 65 02 01 03 0A 07"	= "REL-US";
"06 0A 60 86 48 01 65 02 01 03 0A 08"	= "REL-AUS";
"06 0A 60 86 48 01 65 02 01 03 0A 09"	= "REL-CAN";
"06 0A 60 86 48 01 65 02 01 03 0A 0A"	= "REL-UK";
"06 0A 60 86 48 01 65 02 01 03 0A 0B"	= "REL-NZ";
"06 0A 60 86 48 01 65 02 01 03 0A 0C"	= "Jenis";

"06 09 60 86 48 01 65 02 01 03 0B"			= "Perkhidmatan Umum";
"06 0A 60 86 48 01 65 02 01 03 0B 00"		= "genserNations";
"06 0A 60 86 48 01 65 02 01 03 0B 01"		= "genserComsec";
"06 0A 60 86 48 01 65 02 01 03 0B 02"		= "genserAcquisition";
"06 0A 60 86 48 01 65 02 01 03 0B 03"		= "genserSecurityCategories";
"06 0B 60 86 48 01 65 02 01 03 0B 03 00"	= "genserTagSetName";

"06 09 60 86 48 01 65 02 01 03 0C"			= "Polisi Keselamatan Default";
"06 09 60 86 48 01 65 02 01 03 0D"			= "capcoMarkings";
"06 0A 60 86 48 01 65 02 01 03 0D 00"		= "capcoSecurityCategories";
"06 0B 60 86 48 01 65 02 01 03 0D 00 01"	= "capcoTagSetName1";
"06 0B 60 86 48 01 65 02 01 03 0D 00 02"	= "capcoTagSetName2";
"06 0B 60 86 48 01 65 02 01 03 0D 00 03"	= "capcoTagSetName3";
"06 0B 60 86 48 01 65 02 01 03 0D 00 04"	= "capcoTagSetName4";

"06 09 60 86 48 01 65 02 01 05 01"	= "Sijil Pengurusan Kunci SDNS";
"06 09 60 86 48 01 65 02 01 05 02"	= "Tandatangan Pengguna Sijil SDNS";
"06 09 60 86 48 01 65 02 01 05 03"	= "Tandatangan Sijil dan Kunci Pengurusan SDNS";
"06 09 60 86 48 01 65 02 01 05 04"	= "Sijil Pengurusan Kunci Fortezza";
"06 09 60 86 48 01 65 02 01 05 05"	= "Sijil Pengurusan dan Tandatangan Kunci Fortezza";
"06 09 60 86 48 01 65 02 01 05 06"	= "Tandatangan Sijil Pengguna Fortezza ";
"06 09 60 86 48 01 65 02 01 05 07"	= "Tandatangan Sijil Fortezza CA";
"06 09 60 86 48 01 65 02 01 05 08"	= "Tandatangan Sijil SDNS CA";
"06 09 60 86 48 01 65 02 01 05 0A"	= "Auxiliary Vector";
"06 09 60 86 48 01 65 02 01 05 0B"	= "Polisi Resit";
"06 09 60 86 48 01 65 02 01 05 0C"	= "Keanggotaan";
"06 09 60 86 48 01 65 02 01 05 0D"	= "Pentadbir-pentadbir";
"06 09 60 86 48 01 65 02 01 05 0E"	= "alid";
"06 09 60 86 48 01 65 02 01 05 14"	= "janUKMs";
"06 09 60 86 48 01 65 02 01 05 15"	= "febUKMs";
"06 09 60 86 48 01 65 02 01 05 16"	= "marUKMs";
"06 09 60 86 48 01 65 02 01 05 17"	= "aprUKMs";
"06 09 60 86 48 01 65 02 01 05 18"	= "mayUKMs";
"06 09 60 86 48 01 65 02 01 05 19"	= "junUKMs";
"06 09 60 86 48 01 65 02 01 05 1A"	= "julUKMs";
"06 09 60 86 48 01 65 02 01 05 1B"	= "augUKMs";
"06 09 60 86 48 01 65 02 01 05 1C"	= "sepUKMs";
"06 09 60 86 48 01 65 02 01 05 1D"	= "octUKMs";
"06 09 60 86 48 01 65 02 01 05 1E"	= "novUKMs";
"06 09 60 86 48 01 65 02 01 05 1F"	= "decUKMs";

"06 09 60 86 48 01 65 02 01 05 28"	= "Meta SDNS CKL";
"06 09 60 86 48 01 65 02 01 05 29"	= "SDNS CKL";
"06 09 60 86 48 01 65 02 01 05 2A"	= "Meta SDNS Tandatangan CKL";
"06 09 60 86 48 01 65 02 01 05 2B"	= "SDNS Tandatangan CKL";
"06 09 60 86 48 01 65 02 01 05 2C"	= "Senarai Pembatalan Sijil SDNS";
"06 09 60 86 48 01 65 02 01 05 2D"	= "Senarai Pembatalan Sijil Fortezza";
"06 09 60 86 48 01 65 02 01 05 2E"	= "Fortezza CKL";
"06 09 60 86 48 01 65 02 01 05 2F"	= "Processor Alamat Bebas";
"06 09 60 86 48 01 65 02 01 05 30"	= "Mengawal";
"06 09 60 86 48 01 65 02 01 05 31"	= "Algoritma Disokong";
"06 09 60 86 48 01 65 02 01 05 32"	= "Sijil Pengurusan Kunci Suite A";
"06 09 60 86 48 01 65 02 01 05 33"	= "Sijil Pengurusan dan Tandatangan Kunci Suite A";
"06 09 60 86 48 01 65 02 01 05 34"	= "Tandatangan Sijil Pengguna Suite A";
"06 09 60 86 48 01 65 02 01 05 35"	= "Maklumat PRBAC";
"06 09 60 86 48 01 65 02 01 05 36"	= "Batasan PRBAC CA";
"06 09 60 86 48 01 65 02 01 05 37"	= "Tandatangan atau Keistimewaan Pengurusan Kunci";
"06 09 60 86 48 01 65 02 01 05 38"	= "Keistimewaan Umum";
"06 09 60 86 48 01 65 02 01 05 39"	= "Atribut Berlabel";
"06 09 60 86 48 01 65 02 01 05 3A"	= "Fail Maklumat Dasar";
"06 09 60 86 48 01 65 02 01 05 3B"	= "Fail Maklumat Polisi Sec";
"06 09 60 86 48 01 65 02 01 05 3C"	= "Kekangan Pelepasan CA";

"06 09 60 86 48 01 65 02 01 07 01"		= "Sambungan-sambungan CSP";
"06 0A 60 86 48 01 65 02 01 07 01 00"	= "cspCsExtn";
"06 09 60 86 48 01 65 02 01 08 01"		= "Kategori Keselamatan ISSI";
"06 09 60 86 48 01 65 02 01 08 02"		= "Label Keistimewaan Keselamatan Biasa";

"06 09 60 86 48 01 65 02 01 0A 01"			= "Keistimewaan Tandatangan";
"06 09 60 86 48 01 65 02 01 0A 02"			= "Keistimewaan Pengurusan Kunci";
"06 09 60 86 48 01 65 02 01 0A 03"			= "Named Tag Set Privilege";
"06 09 60 86 48 01 65 02 01 0B 01"			= "UK Demo";
"06 09 60 86 48 01 65 02 01 0B 02"			= "Pihak Pertahanan US Kelas 2";
"06 09 60 86 48 01 65 02 01 0B 03"			= "Pilot Bahantara US";
"06 09 60 86 48 01 65 02 01 0B 04"			= "Pihak Pertahanan US Kelas 4";
"06 09 60 86 48 01 65 02 01 0B 05"			= "Pihak Pertahanan US Kelas 3";
"06 09 60 86 48 01 65 02 01 0B 06"			= "Pihak Pertahanan US Kelas 5";
"06 09 60 86 48 01 65 02 01 0B 09"			= "Pihak Pertahanan US PKI Kelas 3";

"06 09 60 86 48 01 65 02 01 0C 00"			= "Ujian Polisi Keselamatan";
"06 0A 60 86 48 01 65 02 01 0C 00 01"		= "TSP1";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00"	= "TSP1 KategoriKeselamatan";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 00"	= "TSP1 Tag Set Zero";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 01"	= "TSP1 Tag Set One";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 02"	= "TSP1 Tag Set Two";
"06 0A 60 86 48 01 65 02 01 0C 00 02"		= "TSP2";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00"	= "TSP2 Kategori Keselamatan";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 00"	= "TSP2 Tag Set Zero";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 01"	= "TSP2 Tag Set One";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 02"	= "TSP2 Tag Set Two";

"06 0A 60 86 48 01 65 02 01 0C 00 03"		= "Kafka";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00"	= "Kategori Keselamatan kafka";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 01"	= "Kafka Tag Set Name 1";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 02"	= "Kafka Tag Set Name 2";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 03"	= "Kafka Tag Set Name 3";

"06 0A 60 86 48 01 65 02 01 0C 01 01"		= "TCP1";
"06 09 60 86 48 01 65 02 01 0C 02"			= "Cuba Kemasukan CRL";

/* CSOR GAK-FIPS */

"06 07 60 86 48 01 65 03 01"			= "Label";
"06 07 60 86 48 01 65 03 02"			= "PKI";
"06 08 60 86 48 01 65 03 02 01"			= "Pengecam Polisi GAK";
"06 0A 60 86 48 01 65 03 02 01 03 01"	= "Pengecam Polisi Rudimentary FBCA";
"06 0A 60 86 48 01 65 03 02 01 03 02"	= "Pengecam Polisi Biasa FBCA";
"06 0A 60 86 48 01 65 03 02 01 03 03"	= "Pengecam Polisi Bahantara FBCA";
"06 0A 60 86 48 01 65 03 02 01 03 04"	= "Pengecam Polisi Tinggi FBCA";
"06 08 60 86 48 01 65 03 02 02"			= "GAK";
"06 09 60 86 48 01 65 03 02 02 01"		= "Kunci KRA";
"06 08 60 86 48 01 65 03 02 03"			= "Sambungan-sambungan";
"06 09 60 86 48 01 65 03 02 03 01"		= "Teknik Kunci Pemulihan";
"06 09 60 86 48 01 65 03 02 03 02"		= "Keupayan Kunci Pemulihan";
"06 09 60 86 48 01 65 03 02 03 03"		= "Pemulihan Utama";
"06 08 60 86 48 01 65 03 02 04"			= "Schemes Kunci Pemulihan";
"06 08 60 86 48 01 65 03 02 05"			= "Sambungan CSOR GAK";
"06 07 60 86 48 01 65 03 03"			= "ARPA";

/* CSOR (NIST) Algorithms */

"06 07 60 86 48 01 65 03 04"			= "Algoritma NIST";
"06 08 60 86 48 01 65 03 04 01"			= "AES";
"06 09 60 86 48 01 65 03 04 01 01"		= "AES 128-ECB";
"06 09 60 86 48 01 65 03 04 01 02"		= "AES 128-CBC";
"06 09 60 86 48 01 65 03 04 01 03"		= "AES 128-OFB";
"06 09 60 86 48 01 65 03 04 01 04"		= "AES 128-CFB";
"06 09 60 86 48 01 65 03 04 01 15"		= "AES 192-ECB";
"06 09 60 86 48 01 65 03 04 01 16"		= "AES 192-CBC";
"06 09 60 86 48 01 65 03 04 01 17"		= "AES 192-OFB";
"06 09 60 86 48 01 65 03 04 01 18"		= "AES 192-CFB";
"06 09 60 86 48 01 65 03 04 01 29"		= "AES 256-ECB";
"06 09 60 86 48 01 65 03 04 01 2A"		= "AES 256-CBC";
"06 09 60 86 48 01 65 03 04 01 2B"		= "AES 256-OFB";
"06 09 60 86 48 01 65 03 04 01 2C"		= "AES 256-CFB";

/* NIST secure hash algorithms */

"06 08 60 86 48 01 65 03 04 02"         = "SHA";
"06 09 60 86 48 01 65 03 04 02 01"      = "SHA-256";
"06 09 60 86 48 01 65 03 04 02 02"      = "SHA-384";
"06 09 60 86 48 01 65 03 04 02 03"      = "SHA-512";
"06 09 60 86 48 01 65 03 04 02 04"      = "SHA-224";

/* Novell */

"06 0A 60 86 48 01 86 F8 37 01 02 08"		= "Algoritma Novell";
"06 0B 60 86 48 01 86 F8 37 01 02 08 16"	= "DES-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 17"	= "DES-CBC Pad IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 18"	= "DES-EDE2-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 19"	= "DES-EDE2-CBC Pad IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1A"	= "DES-EDE3-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1B"	= "DES-EDE3-CBC Pad IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1C"	= "RC5-CBC Pad";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1D"	= "MD2 dengan Encryption RSA BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1E"	= "MD5 dengan Encryption RSA BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1F"	= "SHA-1 dengan Encryption RSA BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 20"	= "LM Digest";
"06 0B 60 86 48 01 86 F8 37 01 02 08 28"	= "MD2";
"06 0B 60 86 48 01 86 F8 37 01 02 08 32"	= "MD5";
"06 0B 60 86 48 01 86 F8 37 01 02 08 33"	= "IKE HMAC dengan SHA1-RSA";
"06 0B 60 86 48 01 86 F8 37 01 02 08 34"	= "IKE HMAC dengan MD5-RSA";
"06 0B 60 86 48 01 86 F8 37 01 02 08 45"	= "RC2-CBC Pad";
"06 0B 60 86 48 01 86 F8 37 01 02 08 52"	= "SHA-1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 5C"	= "RC2-CBC BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 5F"	= "MD4";
"06 0B 60 86 48 01 86 F8 37 01 02 08 81 02"	= "MD4 Packet";
"06 0C 60 86 48 01 86 F8 37 01 02 08 81 03"	= "RSA Encryption BSAFE1";
"06 0C 60 86 48 01 86 F8 37 01 02 08 81 04"	= "Kata Laluan NW";
"06 0B 60 86 48 01 86 F8 37 01 02 08 81 05"	= "Novell Obfuscate-1";

"06 09 60 86 48 01 86 F8 37 01 09"			= "PKI";
"06 0A 60 86 48 01 86 F8 37 01 09 04"		= "Jenis Sifat PKI";
"06 0B 60 86 48 01 86 F8 37 01 09 04 01"	= "Sifat Keselamatan";
"06 0B 60 86 48 01 86 F8 37 01 09 04 02"	= "Batasan Bergantung";

/* Netscape */

"06 07 60 86 48 01 86 F8 42"		= "Pengesah Objek Netscape";
"06 08 60 86 48 01 86 F8 42 01"		= "Sambungan Sijil Netscape";
"06 09 60 86 48 01 86 F8 42 01 01"	= "Jenis Sijil Netscape";
"06 09 60 86 48 01 86 F8 42 01 02"	= "URL dari Netscape";
"06 09 60 86 48 01 86 F8 42 01 03"	= "URL Penghalang Netscape";
"06 09 60 86 48 01 86 F8 42 01 04"	= "URL Pembatalan Netscape CA";
"06 09 60 86 48 01 86 F8 42 01 05"	= "Netscape CRL Download URL";
"06 09 60 86 48 01 86 F8 42 01 06"	= "URL Muat Turun Sijil Netscape CA";
"06 09 60 86 48 01 86 F8 42 01 07"	= "URL Pembaharuan Sijil Netscape";
"06 09 60 86 48 01 86 F8 42 01 08"	= "URL Polisi Netscape CA";
"06 09 60 86 48 01 86 F8 42 01 09"	= "URL Halaman Web Sijil Netscape";
"06 09 60 86 48 01 86 F8 42 01 0A"	= "Logo Entity Sijil Netscape";
"06 09 60 86 48 01 86 F8 42 01 0B"	= "Gambar Pengguna Sijil Netscape";
"06 09 60 86 48 01 86 F8 42 01 0C"	= "Nama Pelayan SSL Netscape";
"06 09 60 86 48 01 86 F8 42 01 0D"	= "Komen Sijil Netscape";

"06 08 60 86 48 01 86 F8 42 02"		= "Jenis Data Netscape";
"06 09 60 86 48 01 86 F8 42 02 01"	= "imej/GIF";
"06 09 60 86 48 01 86 F8 42 02 02"	= "imej/JPEG";
"06 09 60 86 48 01 86 F8 42 02 03"	= "URL";
"06 09 60 86 48 01 86 F8 42 02 04"	= "teks/HTML";

"06 09 60 86 48 01 86 F8 42 02 05"	= "Turutan Sijil Netscape";
"06 09 60 86 48 01 86 F8 42 02 06"	= "URL Sijil Netscape";

"06 08 60 86 48 01 86 F8 42 03"			= "Pengesah Objek Direktori Netscape";
"06 09 60 86 48 01 86 F8 42 03 01"		= "Definasi LDAP";
"06 0A 60 86 48 01 86 F8 42 03 01 01"	= "Lesen Kereta";
"06 0A 60 86 48 01 86 F8 42 03 01 02"	= "Nombor Departmen";
"06 0A 60 86 48 01 86 F8 42 03 01 03"	= "Nombor Pekerja";
"06 0A 60 86 48 01 86 F8 42 03 01 04"	= "Jenis Pekerja";
"06 0A 60 86 48 01 86 F8 42 03 02 02"	= "Ahli Pertubuhan Intranet";

"06 09 60 86 48 01 86 F8 42 04 01"		= "Server Gated Crypto";

/* Verisign */

/* Country, zip, date of birth (age), and gender of cert owner (CZAG) in obfuscated form */
"06 0A 60 86 48 01 86 F8 45 01 06 03"	= "Verisign CZAG";

/* Text string used in certs issued to Netscape InBox customers */
"06 0A 60 86 48 01 86 F8 45 01 06 06"	= "PetiMasuk Verisign";

"06 0A 60 86 48 01 86 F8 45 01 06 0B"	= "Sambungan VPN Verisign yang tidak dikenali";
"06 0A 60 86 48 01 86 F8 45 01 06 0D"	= "Sambungan VPN Verisign yang tidak dikenali";

"06 0B 60 86 48 01 86 F8 45 01 07 01 01"	= "Pengecam Polisi Verisign";
"06 0C 60 86 48 01 86 F8 45 01 07 01 01 01"	= "Verisign CPS v1 Perhatian";
"06 0C 60 86 48 01 86 F8 45 01 07 01 01 02"	= "Verisign CPS v1 NSI";

"06 0A 60 86 48 01 86 F8 45 01 08 01"		= "Verisign SGC CA";

/* SET */

"06 03 67 2A 00"	= "Jenis Kandungan";
"06 04 67 2A 00 00"	= "Data PAN";
"06 04 67 2A 00 01"	= "Tanda PAN";
"06 04 67 2A 00 02"	= "PAN Sahaja";

"06 03 67 2A 01"	= "Sambungan Mesej";
"06 03 67 2A 02"	= "Medan";
"06 04 67 2A 02 00"	= "Nama Penuh";
"06 04 67 2A 02 01"	= "Nama yang Diberi";
"06 04 67 2A 02 02"	= "Nama Keluarga";
"06 04 67 2A 02 03"	= "Nama Kelahiran Keluarga";
"06 04 67 2A 02 04"	= "Nama Tempat";
"06 04 67 2A 02 05"	= "Nombor Pengesahan";
"06 04 67 2A 02 06"	= "Bulan";
"06 04 67 2A 02 07"	= "Tarikh";
"06 04 67 2A 02 08"	= "Alamat";
"06 04 67 2A 02 09"	= "Telefon";
"06 04 67 2A 02 0A"	= "Jumlah";
"06 04 67 2A 02 0B"	= "Nombor Akaun";
"06 04 67 2A 02 0C"	= "Frasa Laluan";

"06 03 67 2A 03"		= "Sifat";
"06 04 67 2A 03 00"		= "Sijil";
"06 05 67 2A 03 00 00"	= "Kunci Asal Thumbprint";
"06 05 67 2A 03 00 01"	= "Polisi Tambahan";

"06 03 67 2A 04"	= "Algoritma";
"06 03 67 2A 05"	= "Polisi";
"06 04 67 2A 05 00"	= "Asal";
"06 03 67 2A 06"	= "Module";
"06 03 67 2A 07"	= "Sambungan Sijil";
"06 04 67 2A 07 00"	= "Kunci Hash Asal";
"06 04 67 2A 07 01"	= "Jenis Sijil";
"06 04 67 2A 07 02"	= "Maklumat Peniaga";
"06 04 67 2A 07 03"	= "Sijil Kad Diperlukan";
"06 04 67 2A 07 04"	= "Tunneling";
"06 04 67 2A 07 05"	= "Sambungan SET";
"06 04 67 2A 07 06"	= "Kelayakan SET";

"06 03 67 2A 08"	= "Brand";
"06 04 67 2A 08 01"		= "IATA-ATA";
"06 04 67 2A 08 04"		= "VISA";
"06 04 67 2A 08 05"		= "MasterCard";
"06 04 67 2A 08 1E"		= "Diners";
"06 04 67 2A 08 22"		= "American Express";
"06 05 67 2A 08 AE 7B"	= "Novus";

"06 03 67 2A 09"	= "Penjaja";
"06 04 67 2A 09 00"	= "GlobeSet";
"06 04 67 2A 09 01"	= "IBM";
"06 04 67 2A 09 02"	= "CyberCash";
"06 04 67 2A 09 03"	= "Terisa";
"06 04 67 2A 09 04"	= "RSADSI";
"06 04 67 2A 09 05"	= "VeriFone";
"06 04 67 2A 09 06"	= "TrinTech";
"06 04 67 2A 09 07"	= "BankGate";
"06 04 67 2A 09 08"	= "GTE";
"06 04 67 2A 09 09"	= "CompuSource";
"06 04 67 2A 09 0A"	= "Griffin";
"06 04 67 2A 09 0B"	= "Certicom";
"06 04 67 2A 09 0C"	= "OSS";
"06 04 67 2A 09 0D"	= "TenthMountain";
"06 04 67 2A 09 0E"	= "Antares";
"06 04 67 2A 09 0F"	= "ECC";
"06 04 67 2A 09 10"	= "Maithean";
"06 04 67 2A 09 11"	= "Netscape";
"06 04 67 2A 09 12"	= "Verisign";
"06 04 67 2A 09 13"	= "BlueMoney";
"06 04 67 2A 09 14"	= "Lacerte";
"06 04 67 2A 09 15"	= "Fujitsu";
"06 04 67 2A 09 16"	= "eLab";
"06 04 67 2A 09 17"	= "Percaya";
"06 04 67 2A 09 18"	= "VIAnet";
"06 04 67 2A 09 19"	= "III";
"06 04 67 2A 09 1A"	= "OpenMarket";
"06 04 67 2A 09 1B"	= "Lexem";
"06 04 67 2A 09 1C"	= "Intertrader";
"06 04 67 2A 09 1D"	= "Persimmon";
"06 04 67 2A 09 1E"	= "NABLE";
"06 04 67 2A 09 1F"	= "espace-net";
"06 04 67 2A 09 20"	= "Hitachi";
"06 04 67 2A 09 21"	= "Microsoft";
"06 04 67 2A 09 22"	= "NEC";
"06 04 67 2A 09 23"	= "Mitsubishi";
"06 04 67 2A 09 24"	= "NCR";
"06 04 67 2A 09 25"	= "e-COMM";
"06 04 67 2A 09 26"	= "Gemplus";

"06 03 67 2A 0A"	= "Seluruh Negara";
"06 05 67 2A 0A E2 00"	= "Jepun";

/* Draft SET (deprecated) */

"06 04 86 8D 6F 02"	= "Kunci Hash Asal";
"06 04 86 8D 6F 03"	= "Jenis Sijil";
"06 04 86 8D 6F 04"	= "Maklumat Peniaga";
"06 04 86 8D 6F 05"	= "Sijil Kad Diperlukan";
"06 04 86 8D 6F 06"	= "Tunneling";
"06 04 86 8D 6F 07"	= "Kelayakan SET";
"06 04 86 8D 6F 63"	= "Maklumat SET";

/* Apple */

"06 06 2A 86 48 86 F7 63"		= "Apple";
"06 07 2A 86 48 86 F7 63 64"	= "Keselamatan Data Apple";

"06 08 2A 86 48 86 F7 63 64 01" = "Pengecam Identity Trust Apple";
"06 09 2A 86 48 86 F7 63 64 01 01"  = "Dasar Apple iSign";
"06 09 2A 86 48 86 F7 63 64 01 02"  = "Dasar Asas Apple X.509";
"06 09 2A 86 48 86 F7 63 64 01 03"  = "Polisi SSL Apple";
"06 09 2A 86 48 86 F7 63 64 01 04"  = "Dasar Penjanaan Sijil Tempatan Apple";
"06 09 2A 86 48 86 F7 63 64 01 05"  = "Dasar Penjanaan CSR Tempatan Apple";
"06 09 2A 86 48 86 F7 63 64 01 06"  = "Dasar Pembatalan Apple CRL";
"06 09 2A 86 48 86 F7 63 64 01 07"  = "Dasar Pembatalan Apple OCSP";
"06 09 2A 86 48 86 F7 63 64 01 08"  = "Polici S/MIME Apple";
"06 09 2A 86 48 86 F7 63 64 01 09"  = "Pengesahan Polisi Extensible Apple";
"06 09 2A 86 48 86 F7 63 64 01 0A"  = "Dasar Tandatangan Kemas Kini Perisian Apple";
"06 09 2A 86 48 86 F7 63 64 01 0B"  = "Polisi Apple IPsec";
"06 09 2A 86 48 86 F7 63 64 01 0C"  = "Polisi Apple iChat";
"06 09 2A 86 48 86 F7 63 64 01 0D"  = "Polisi Tandatangan Sumber Apple";
"06 09 2A 86 48 86 F7 63 64 01 0E"  = "Dasar Klien Apple Kerberos";
"06 09 2A 86 48 86 F7 63 64 01 0F"  = "Dasar Pelayan Apple Kerberos";
"06 09 2A 86 48 86 F7 63 64 01 10"  = "Polisi Tandatangan Kod Apple";
"06 09 2A 86 48 86 F7 63 64 01 11"  = "Dasar Tandatangan Pakej Apple";

"06 08 2A 86 48 86 F7 63 64 02" = "Pengecam Algoritma Keselamatan Apple";
"06 09 2A 86 48 86 F7 63 64 02 01"  = "Fast Elliptic Encryption (FEE)";
"06 09 2A 86 48 86 F7 63 64 02 02"  = "Mampatan Keselamatan Apple (Apple Secure Compression)";
"06 09 2A 86 48 86 F7 63 64 02 03"  = "FEE dengan Tandatangan MD5";
"06 09 2A 86 48 86 F7 63 64 02 04"  = "FEE dengan Tandatangan SHA-1";
"06 09 2A 86 48 86 F7 63 64 02 05"  = "Apple FEED Encryption";
"06 09 2A 86 48 86 F7 63 64 02 06"  = "Apple FEED (Untuk Percubaan)";
"06 09 2A 86 48 86 F7 63 64 02 07"  = "FEE dengan Tandatangan ECDSA";

"06 08 2A 86 48 86 F7 63 64 03" = "Apple .Mac Certificate Identifier";
"06 09 2A 86 48 86 F7 63 64 03 01"  = "Apple .Mac Sambungan Sijil";
"06 0A 2A 86 48 86 F7 63 64 03 01 01"  = "Apple .Mac Permintaan Sijil Identiti";
"06 0A 2A 86 48 86 F7 63 64 03 01 02"  = "Apple .Mac Permintaan Tanda Sijil E-mel ";
"06 0A 2A 86 48 86 F7 63 64 03 01 03"  = "Apple .Mac Permintaan Sijil E-mel Encryption";
"06 0A 2A 86 48 86 F7 63 64 03 01 04"  = "Apple .Mac Archive List Request";
"06 0A 2A 86 48 86 F7 63 64 03 01 05"  = "Apple .Mac Archive Store Request";
"06 0A 2A 86 48 86 F7 63 64 03 01 06"  = "Apple .Mac Archive Fetch Request";
"06 0A 2A 86 48 86 F7 63 64 03 01 07"  = "Apple .Mac Archive Remove Request";
"06 09 2A 86 48 86 F7 63 64 03 02"  = "Apple .Mac Certificate Extension";
"06 0A 2A 86 48 86 F7 63 64 03 02 01"   = "Apple .Mac Identity";
"06 0A 2A 86 48 86 F7 63 64 03 02 02"   = "Apple .Mac Tanda E-mel";
"06 0A 2A 86 48 86 F7 63 64 03 02 03"   = "Enkripsi E-mel Apple .Mac";
"06 09 2A 86 48 86 F7 63 64 03 03"  = "Apple .Mac Nilai Yang Diminta";
"06 0A 2A 86 48 86 F7 63 64 03 03 01"  = "Nama Pengguna";
"06 0A 2A 86 48 86 F7 63 64 03 03 02"  = "Kata Laluan";
"06 0A 2A 86 48 86 F7 63 64 03 03 03"  = "Nama Host";
"06 0A 2A 86 48 86 F7 63 64 03 03 04"  = "Pembaharuan Bendera";
"06 0A 2A 86 48 86 F7 63 64 03 03 05"  = "Tanda Asynchronous";

"06 08 2A 86 48 86 F7 63 64 04" = "Kegunaan Kunci Tambahan Apple";
"06 09 2A 86 48 86 F7 63 64 04 01"  = "Tandatangan Kod Apple";
"06 0A 2A 86 48 86 F7 63 64 04 01 01"  = "Tandatangan Kod Apple (Pembangunan)";
"06 0A 2A 86 48 86 F7 63 64 04 01 02"  = "Tandatangan Kemas Kini Perisian Apple";
"06 0A 2A 86 48 86 F7 63 64 04 01 03"  = "Tandatangan Kod Apple (Simpanan)";
"06 0A 2A 86 48 86 F7 63 64 04 01 04"  = "Tandatangan Sumber Apple";
"06 09 2A 86 48 86 F7 63 64 04 02"  = "Tandatangan iChat Apple";
"06 09 2A 86 48 86 F7 63 64 04 03"  = "Apple iChat Encryption";
"06 09 2A 86 48 86 F7 63 64 04 04"  = "Identiti Sistem Apple";

"06 08 2A 86 48 86 F7 63 64 05" = "Polisi Sijil Apple";
"06 09 2A 86 48 86 F7 63 64 05 01"  = "Polisi Sijil Apple";
"06 09 2A 86 48 86 F7 63 64 05 02"  = "Apple .Mac Polisi Sijil";

/* Extended key usage */

"06 04 55 1D 25 03"					= "Tandatangan Kod";

/* Intel CDSA-specific */

"06 07 60 86 48 01 86 F8 4D"	= "Intel";
"06 08 60 86 48 01 86 F8 4D 02"	= "Keselamatan Intel CDSA";

"06 09 60 86 48 01 86 F8 4D 02 01"	= "Keselamatan Format Intel CDSA";
"06 0B 60 86 48 01 86 F8 4D 02 01 01 01"	= "Sambungan Sijil X.509v3";
"06 0C 60 86 48 01 86 F8 4D 02 01 01 01 32"	= "Sambungan Sijil Peribadi X.509v3";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 01"	= "Tandatangan Subjek Bitmap";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 02"	= "Gambar Subjek";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 03"	= "Alamat E-mel Subjek";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 04"	= "Gunakan Pengecualian";

"06 0A 60 86 48 01 86 F8 4D 02 02 05"	= "Algoritma Keselamatan Intel CDSA";
"06 0B 60 86 48 01 86 F8 4D 02 02 05 51"	= "SHA-1 dengan ECDSA";

/* end */
